Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="32xxxx" edc:clonedfrom="PIC32MZ1025W104132" edc:desc="" edc:dosid="DOS-05046" edc:dsid="" edc:hasfreeze="true" edc:informedby="DOS" edc:isextended="false" edc:masksetid="SG403" edc:name="PIC32MZ2051W104132" edc:procid="0x0699" edc:psid="" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Import/>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.300" edc:maxvoltage="3.600" edc:minvoltage="2.500"/>
    <edc:VDD edc:maxdefaultvoltage="3.600" edc:maxvoltage="3.600" edc:mindefaultvoltage="2.500" edc:minvoltage="2.500" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true">
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="10" edc:timeunits="ms"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="10" edc:timeunits="ms"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="10" edc:timeunits="ms"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="cfg"/>
    <edc:Wait edc:erase="10" edc:pgm="10" edc:cfg="10"/>
    <edc:Latches edc:pgm="1" edc:cfg="1"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="32xxxx" edc:name="32xxxx">
    <edc:MemTraits edc:addrinc="0x4" edc:locsize="0x4" edc:wordimpl="0xffffffff" edc:wordinit="0xffffffff" edc:wordsafe="0xffffffff" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet>
    <edc:InstructionSet edc:instructionsetid="mips32r2"/>
    <edc:InstructionSet edc:instructionsetid="micromips"/>
    <edc:InstructionSet edc:instructionsetid="dspr2"/>
  </edc:InstructionSet>
  <edc:L1Cache/>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList edc:hasvariableoffsets="true" edc:interruptcontrollerflavor="int_evic_v3" edc:shadowsetcount="8">
    <edc:Interrupt edc:cname="CORE_TIMER" edc:desc="Core Timer" edc:irq="0"/>
    <edc:Interrupt edc:cname="CORE_SOFTWARE_0" edc:desc="Core Software 0" edc:irq="1"/>
    <edc:Interrupt edc:cname="CORE_SOFTWARE_1" edc:desc="Core Software 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="EXTERNAL_0" edc:desc="Ext INT 0" edc:irq="3"/>
    <edc:Interrupt edc:cname="TIMER_1" edc:desc="Timer1" edc:irq="4"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_1_ERROR" edc:desc="Input Capture 1 Error" edc:irq="5"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_1" edc:desc="Input Capture 1" edc:irq="6"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_1" edc:desc="Output Compare 1" edc:irq="7"/>
    <edc:Interrupt edc:cname="EXTERNAL_1" edc:desc="Ext INT 1" edc:irq="8"/>
    <edc:Interrupt edc:cname="TIMER_2" edc:desc="Timer2" edc:irq="9"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_2_ERROR" edc:desc="Input Capture 2 Error" edc:irq="10"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_2" edc:desc="Input Capture 2" edc:irq="11"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_2" edc:desc="Output Compare 2" edc:irq="12"/>
    <edc:Interrupt edc:cname="EXTERNAL_2" edc:desc="Ext INT 2" edc:irq="13"/>
    <edc:Interrupt edc:cname="TIMER_3" edc:desc="Timer3" edc:irq="14"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_3_ERROR" edc:desc="Input Capture 3 Error" edc:irq="15"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_3" edc:desc="Input Capture 3" edc:irq="16"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_3" edc:desc="Output Compare 3" edc:irq="17"/>
    <edc:Interrupt edc:cname="EXTERNAL_3" edc:desc="Ext INT 3" edc:irq="18"/>
    <edc:Interrupt edc:cname="TIMER_4" edc:desc="Timer4" edc:irq="19"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_4_ERROR" edc:desc="Input Capture 4 Error" edc:irq="20"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_4" edc:desc="Input Capture 4" edc:irq="21"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_4" edc:desc="Output Compare 4" edc:irq="22"/>
    <edc:Interrupt edc:cname="EXTERNAL_4" edc:desc="Ext INT 4" edc:irq="23"/>
    <edc:Interrupt edc:cname="TIMER_5" edc:desc="Timer5" edc:irq="24"/>
    <edc:Interrupt edc:cname="FLASH_CONTROL" edc:desc="Flash Control Event" edc:irq="30"/>
    <edc:Interrupt edc:cname="PREFETCH" edc:desc="Prefetch Module SEC Event" edc:irq="31"/>
    <edc:Interrupt edc:cname="PFW_CRC" edc:desc="PFW CRC event" edc:irq="32"/>
    <edc:Interrupt edc:cname="RTCC" edc:desc="REAL_TIME_CLOCK" edc:irq="33"/>
    <edc:Interrupt edc:cname="USB" edc:desc="USB_1" edc:irq="34"/>
    <edc:Interrupt edc:cname="SPI1_FAULT" edc:desc="SPI_1_FAULT" edc:irq="35"/>
    <edc:Interrupt edc:cname="SPI1_RX" edc:desc="SPI_1_RECEIVE" edc:irq="36"/>
    <edc:Interrupt edc:cname="SPI1_TX" edc:desc="SPI_1_TRANSFER" edc:irq="37"/>
    <edc:Interrupt edc:cname="UART1_FAULT" edc:desc="UART_1_FAULT" edc:irq="38"/>
    <edc:Interrupt edc:cname="UART1_RX" edc:desc="UART_1_RECEIVE" edc:irq="39"/>
    <edc:Interrupt edc:cname="UART1_TX" edc:desc="UART_1_TRANSFER" edc:irq="40"/>
    <edc:Interrupt edc:cname="I2C1_BUS" edc:desc="I2C_1_BUS_COLLISION_EVENT" edc:irq="41"/>
    <edc:Interrupt edc:cname="I2C1_SLAVE" edc:desc="I2C_1_SLAVE_EVENT" edc:irq="42"/>
    <edc:Interrupt edc:cname="I2C1_MASTER" edc:desc="I2C_1_MASTER_EVENT" edc:irq="43"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_A" edc:desc="PORT_A_INPUT_CHANGE_INTERRUPT" edc:irq="44"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_B" edc:desc="PORT_B_INPUT_CHANGE_INTERRUPT" edc:irq="45"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_C" edc:desc="PORT_C_INPUT_CHANGE_INTERRUPT" edc:irq="46"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE_K" edc:desc="PORT_D_INPUT_CHANGE_INTERRUPT" edc:irq="47"/>
    <edc:Interrupt edc:cname="SPI2_FAULT" edc:desc="SPI 2 Fault" edc:irq="53"/>
    <edc:Interrupt edc:cname="SPI2_RX" edc:desc="SPI 2 Receive Done" edc:irq="54"/>
    <edc:Interrupt edc:cname="SPI2_TX" edc:desc="SPI 2 Transfer Done" edc:irq="55"/>
    <edc:Interrupt edc:cname="UART2_FAULT" edc:desc="UART 2 Error" edc:irq="56"/>
    <edc:Interrupt edc:cname="UART2_RX" edc:desc="UART 2 Receiver" edc:irq="57"/>
    <edc:Interrupt edc:cname="UART2_TX" edc:desc="UART 2 Transmitter" edc:irq="58"/>
    <edc:Interrupt edc:cname="I2C2_BUS" edc:desc="I2C 2 Bus Collision Event" edc:irq="59"/>
    <edc:Interrupt edc:cname="I2C2_SLAVE" edc:desc="I2C 2 Slave Event" edc:irq="60"/>
    <edc:Interrupt edc:cname="I2C2_MASTER" edc:desc="I2C 2 Master Event" edc:irq="61"/>
    <edc:Interrupt edc:cname="UART3_FAULT" edc:desc="UART_3_FAULT" edc:irq="62"/>
    <edc:Interrupt edc:cname="UART3_RX" edc:desc="UART_3_RECEIVE" edc:irq="63"/>
    <edc:Interrupt edc:cname="UART3_TX" edc:desc="UART_3_TRANSFER" edc:irq="64"/>
    <edc:Interrupt edc:cname="DMA0" edc:desc="DMA Channel 0" edc:irq="68"/>
    <edc:Interrupt edc:cname="DMA1" edc:desc="DMA Channel 1" edc:irq="69"/>
    <edc:Interrupt edc:cname="DMA2" edc:desc="DMA Channel 2" edc:irq="70"/>
    <edc:Interrupt edc:cname="DMA3" edc:desc="DMA Channel 3" edc:irq="71"/>
    <edc:Interrupt edc:cname="DMA4" edc:desc="DMA Channel 4" edc:irq="72"/>
    <edc:Interrupt edc:cname="DMA5" edc:desc="DMA Channel 5" edc:irq="73"/>
    <edc:Interrupt edc:cname="DMA6" edc:desc="DMA Channel 6" edc:irq="74"/>
    <edc:Interrupt edc:cname="DMA7" edc:desc="DMA Channel 7" edc:irq="75"/>
    <edc:Interrupt edc:cname="TIMER_6" edc:desc="Timer 6" edc:irq="76"/>
    <edc:Interrupt edc:cname="TIMER_7" edc:desc="Timer 7" edc:irq="80"/>
    <edc:Interrupt edc:cname="RFSMC" edc:desc="WiFi SMC Event" edc:irq="83"/>
    <edc:Interrupt edc:cname="RFMAC" edc:desc="WiFi MAC Event" edc:irq="84"/>
    <edc:Interrupt edc:cname="CTR1_EVENT" edc:desc="CTR1 EVENT" edc:irq="85"/>
    <edc:Interrupt edc:cname="RFTM0" edc:desc="WiFi Timer 0 Event" edc:irq="86"/>
    <edc:Interrupt edc:cname="RFTM1" edc:desc="WiFi Timer 1 Event" edc:irq="87"/>
    <edc:Interrupt edc:cname="RFTM2" edc:desc="WiFi Timer 2 Event" edc:irq="88"/>
    <edc:Interrupt edc:cname="RFTM3" edc:desc="WiFi Timer 3 Event" edc:irq="89"/>
    <edc:Interrupt edc:cname="CTR1_TRG" edc:desc="CTR1 Trig out event" edc:irq="90"/>
    <edc:Interrupt edc:cname="RFWCOE" edc:desc="WiFi WCOE Event" edc:irq="91"/>
    <edc:Interrupt edc:cname="ADC" edc:desc="ADC global" edc:irq="92"/>
    <edc:Interrupt edc:cname="ADC_DC1" edc:desc="ADC Digital Comparator 1" edc:irq="94"/>
    <edc:Interrupt edc:cname="ADC_DC2" edc:desc="ADC Digital Comparator 2" edc:irq="95"/>
    <edc:Interrupt edc:cname="ADC_DF1" edc:desc="ADC Digital Filter 1" edc:irq="96"/>
    <edc:Interrupt edc:cname="ADC_DF2" edc:desc="ADC Digital Filter 2" edc:irq="97"/>
    <edc:Interrupt edc:cname="ADC_FAULT" edc:desc="ADC Fault Interrupt" edc:irq="100"/>
    <edc:Interrupt edc:cname="ADC_EOS" edc:desc="ADC EO Scan" edc:irq="101"/>
    <edc:Interrupt edc:cname="ADC_ARDY" edc:desc="ADC Analog Ready" edc:irq="102"/>
    <edc:Interrupt edc:cname="ADC_URDY" edc:desc="ADC Update Rdy after Suspend" edc:irq="103"/>
    <edc:Interrupt edc:cname="ADC_DMA" edc:desc="ADC 1st Class Buffer Transfer" edc:irq="104"/>
    <edc:Interrupt edc:cname="ADC_DATA0" edc:desc="ADC A Data #0" edc:irq="106"/>
    <edc:Interrupt edc:cname="ADC_DATA1" edc:desc="ADC A Data #1" edc:irq="107"/>
    <edc:Interrupt edc:cname="ADC_DATA2" edc:desc="ADC A Data #2" edc:irq="108"/>
    <edc:Interrupt edc:cname="ADC_DATA3" edc:desc="ADC A Data #3" edc:irq="109"/>
    <edc:Interrupt edc:cname="ADC_DATA4" edc:desc="ADC A Data #4" edc:irq="110"/>
    <edc:Interrupt edc:cname="ADC_DATA5" edc:desc="ADC A Data #5" edc:irq="111"/>
    <edc:Interrupt edc:cname="ADC_DATA6" edc:desc="ADC A Data #6" edc:irq="112"/>
    <edc:Interrupt edc:cname="ADC_DATA7" edc:desc="ADC A Data #7" edc:irq="113"/>
    <edc:Interrupt edc:cname="ADC_DATA8" edc:desc="ADC A Data #8" edc:irq="114"/>
    <edc:Interrupt edc:cname="ADC_DATA9" edc:desc="ADC A Data #9" edc:irq="115"/>
    <edc:Interrupt edc:cname="ADC_DATA10" edc:desc="ADC A Data #10" edc:irq="116"/>
    <edc:Interrupt edc:cname="ADC_DATA11" edc:desc="ADC A Data #11" edc:irq="117"/>
    <edc:Interrupt edc:cname="ADC_DATA12" edc:desc="ADC A Data #12" edc:irq="118"/>
    <edc:Interrupt edc:cname="ADC_DATA13" edc:desc="ADC A Data #13" edc:irq="119"/>
    <edc:Interrupt edc:cname="ADC_DATA14" edc:desc="ADC A Data #14" edc:irq="120"/>
    <edc:Interrupt edc:cname="ADC_DATA15" edc:desc="ADC A Data #15" edc:irq="121"/>
    <edc:Interrupt edc:cname="ADC_DATA16" edc:desc="ADC A Data #16" edc:irq="122"/>
    <edc:Interrupt edc:cname="ADC_DATA17" edc:desc="ADC A Data #17" edc:irq="123"/>
    <edc:Interrupt edc:cname="ADC_DATA18" edc:desc="ADC A Data #18" edc:irq="124"/>
    <edc:Interrupt edc:cname="ADC_DATA19" edc:desc="ADC A Data #19" edc:irq="125"/>
    <edc:Interrupt edc:cname="ADC_DATA20" edc:desc="ADC A Data #20" edc:irq="126"/>
    <edc:Interrupt edc:cname="ADC_DATA21" edc:desc="ADC A Data #21" edc:irq="127"/>
    <edc:Interrupt edc:cname="ADC_DATA22" edc:desc="ADC A Data #22" edc:irq="128"/>
    <edc:Interrupt edc:cname="ADC_DATA23" edc:desc="ADC A Data #23" edc:irq="129"/>
    <edc:Interrupt edc:cname="CAN1" edc:desc="CAN Combined Interrupt" edc:irq="142"/>
    <edc:Interrupt edc:cname="CAN2_RX" edc:desc="CAN2 Receive Interrupt" edc:irq="143"/>
    <edc:Interrupt edc:cname="CAN2_TX" edc:desc="CAN2 Transmit Interrupt" edc:irq="144"/>
    <edc:Interrupt edc:cname="CAN2_MISC" edc:desc="CAN2 Misc Interrupt" edc:irq="145"/>
    <edc:Interrupt edc:cname="SQI1" edc:desc="SQI Event Completion" edc:irq="150"/>
    <edc:Interrupt edc:cname="PTG0_STEP" edc:desc="PTG Step Complete" edc:irq="152"/>
    <edc:Interrupt edc:cname="PTG0_WDT" edc:desc="PTG Watchdog Timeout" edc:irq="153"/>
    <edc:Interrupt edc:cname="PTG0_TRG0" edc:desc="PTG Int. Trigger 0" edc:irq="154"/>
    <edc:Interrupt edc:cname="PTG0_TRG1" edc:desc="PTG Int. Trigger 1" edc:irq="155"/>
    <edc:Interrupt edc:cname="PTG0_TRG2" edc:desc="PTG Int. Trigger 2" edc:irq="156"/>
    <edc:Interrupt edc:cname="PTG0_TRG3" edc:desc="PTG Int. Trigger 3" edc:irq="157"/>
    <edc:Interrupt edc:cname="CORE_PERF_COUNT" edc:desc="Core perform. counter event" edc:irq="162"/>
    <edc:Interrupt edc:cname="CORE_FAST_DEBUG_CHAN" edc:desc="Fast Debug Channel Event" edc:irq="163"/>
    <edc:Interrupt edc:cname="CRYPTO" edc:desc="Crypto Engine Event" edc:irq="164"/>
    <edc:Interrupt edc:cname="ETHERNET" edc:desc="Ethernet" edc:irq="165"/>
    <edc:Interrupt edc:cname="CRYPTO1" edc:desc="Asymmetric Crypto Engine End Event" edc:irq="166"/>
    <edc:Interrupt edc:cname="CRYPTO1_FAULT" edc:desc="Asymmetric Crypto Engine Error Event" edc:irq="167"/>
    <edc:Interrupt edc:cname="CVD_EVENT" edc:desc="cvd event" edc:irq="168"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasappinout="true" edc:hasdatacapture="true" edc:hwbpcount="12"/>
  <edc:Freeze edc:addr="0xBF812000">
    <edc:FreezeBit edc:freezeval="1" edc:pos="14"/>
  </edc:Freeze>
  <edc:ProjectionTable edc:ksegmask="0xFF000000">
    <edc:Projection edc:ksegval="0x80000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x90000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x9F000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x9F000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0xA0000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xB0000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xBF000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xFF000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0xFF000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
  </edc:ProjectionTable>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="zero" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="zero" edc:nmmrflags="St" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="at" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="at" edc:nmmrflags="St" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="at" edc:desc="" edc:mask="0xffffffff" edc:name="at" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
