Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="--n-------------------------nnnn" edc:cname="HWREna" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="HWREna" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="156">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0xf" edc:name="Mask" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:SFRFieldDef edc:cname="ULR" edc:desc="" edc:mask="0x1" edc:name="ULR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BadVAddr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="BadVAddr" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="160">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BadVAddr" edc:desc="" edc:mask="0xffffffff" edc:name="BadVAddr" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="Count" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Count" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="164">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Count" edc:desc="" edc:mask="0xffffffff" edc:name="Count" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnn-----nnnnnnnnn" edc:cname="EntryHi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="EntryHi" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="168">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="VPN2" edc:desc="" edc:mask="0x7ffff" edc:name="VPN2" edc:nzwidth="0x13"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="Compare" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Compare" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="172">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Compare" edc:desc="" edc:mask="0xffffffff" edc:name="Compare" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nn-nn-nnnnn-nnnnnnn-----n-nnn" edc:cname="Status" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000010000000000000000000000" edc:name="Status" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000010000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="176">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXL" edc:desc="" edc:mask="0x1" edc:name="EXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERL" edc:desc="" edc:mask="0x1" edc:name="ERL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="UM" edc:desc="" edc:mask="0x1" edc:name="UM" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="IPL" edc:desc="" edc:mask="0x7f" edc:name="IPL" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="IPL7" edc:desc="" edc:mask="0x1" edc:name="IPL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:desc="" edc:mask="0x1" edc:name="NMI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR" edc:desc="" edc:mask="0x1" edc:name="SR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TS" edc:desc="" edc:mask="0x1" edc:name="TS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BEV" edc:desc="" edc:mask="0x1" edc:name="BEV" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MX" edc:desc="" edc:mask="0x1" edc:name="MX" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE" edc:desc="" edc:mask="0x1" edc:name="RE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RP" edc:desc="" edc:mask="0x1" edc:name="RP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CU0" edc:desc="" edc:mask="0x1" edc:name="CU0" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------nnnnnnnnnn---nnnnn-----" edc:cname="IntCtl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IntCtl" edc:nmmrflags="0a" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="304">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="VS" edc:desc="" edc:mask="0x1f" edc:name="VS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USESTK" edc:desc="" edc:mask="0x1" edc:name="USESTK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APE" edc:desc="" edc:mask="0x1" edc:name="APE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLREXL" edc:desc="" edc:mask="0x1" edc:name="CLREXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STKDEC" edc:desc="" edc:mask="0x1f" edc:name="STKDEC" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ICE" edc:desc="" edc:mask="0x1" edc:name="ICE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PF" edc:desc="" edc:mask="0x1" edc:name="PF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--rrrr----rrrr--nnnn--nnnn--rrrr" edc:cname="SRSCtl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00011100000000000000000000000000" edc:name="SRSCtl" edc:nmmrflags="0b" edc:nzwidth="0x20" edc:por="00011100000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="432">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="" edc:mask="0xf" edc:name="CSS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0xf" edc:name="PSS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ESS" edc:desc="" edc:mask="0xf" edc:name="ESS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="EICSS" edc:desc="" edc:mask="0xf" edc:name="EICSS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="HSS" edc:desc="" edc:mask="0xf" edc:name="HSS" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRSMap" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SRSMap" edc:nmmrflags="0c" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="560">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSV0" edc:desc="" edc:mask="0xf" edc:name="SSV0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV1" edc:desc="" edc:mask="0xf" edc:name="SSV1" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV2" edc:desc="" edc:mask="0xf" edc:name="SSV2" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV3" edc:desc="" edc:mask="0xf" edc:name="SSV3" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV4" edc:desc="" edc:mask="0xf" edc:name="SSV4" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV5" edc:desc="" edc:mask="0xf" edc:name="SSV5" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV6" edc:desc="" edc:mask="0xf" edc:name="SSV6" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV7" edc:desc="" edc:mask="0xf" edc:name="SSV7" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
