Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="----------------------nnnnnnnn--" edc:cname="View_IPL" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="View_IPL" edc:nmmrflags="0d" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="688">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="IPL" edc:desc="" edc:mask="0xff" edc:name="IPL" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRSMAP2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SRSMAP2" edc:nmmrflags="0e" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="816">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSV8" edc:desc="" edc:mask="0xf" edc:name="SSV8" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV9" edc:desc="" edc:mask="0xf" edc:name="SSV9" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrnrrrnnr---rrrrrrrrnn-rrrrr--" edc:cname="Cause" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Cause" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="180">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ExcCode" edc:desc="" edc:mask="0x1f" edc:name="ExcCode" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="IP" edc:desc="" edc:mask="0x3" edc:name="IP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RIPL" edc:desc="" edc:mask="0xff" edc:name="RIPL" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="FDCI" edc:desc="" edc:mask="0x1" edc:name="FDCI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WP" edc:desc="" edc:mask="0x1" edc:name="WP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IV" edc:desc="" edc:mask="0x1" edc:name="IV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="" edc:mask="0x1" edc:name="AP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC" edc:desc="" edc:mask="0x1" edc:name="IC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCI" edc:desc="" edc:mask="0x1" edc:name="PCI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CE" edc:desc="" edc:mask="0x3" edc:name="CE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TI" edc:desc="" edc:mask="0x1" edc:name="TI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BD" edc:desc="" edc:mask="0x1" edc:name="BD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------rrrrrrrrnn" edc:cname="View_RIPL" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="View_RIPL" edc:nmmrflags="0d" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="692">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IP" edc:desc="" edc:mask="0x3" edc:name="IP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RIPL" edc:desc="" edc:mask="0xff" edc:name="RIPL" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------------------nn-" edc:cname="NestedExc" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NestedExc" edc:nmmrflags="0e" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="NEXL" edc:desc="" edc:mask="0x3" edc:name="NEXL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="NERL" edc:desc="" edc:mask="0x3" edc:name="NERL" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="EPC" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="184">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPC" edc:desc="" edc:mask="0xffffffff" edc:name="EPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NestedEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NestedEPC" edc:nmmrflags="0b" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPC" edc:desc="" edc:mask="0xffffffff" edc:name="EPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
