Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="r-------------------------------" edc:cname="Config2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config2" edc:nmmrflags="0b" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="448">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r--------rrrrrrnrrrrrr-r-rrrr--r" edc:cname="Config3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000001000101011110101100000" edc:name="Config3" edc:nmmrflags="0c" edc:nzwidth="0x20" edc:por="10000000001000101011110101100000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="576">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TL" edc:desc="" edc:mask="0x1" edc:name="TL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CDDM" edc:desc="" edc:mask="0x1" edc:name="CDDM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SP" edc:desc="" edc:mask="0x1" edc:name="SP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VInt" edc:desc="" edc:mask="0x1" edc:name="VInt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VEIC" edc:desc="" edc:mask="0x1" edc:name="VEIC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ITL" edc:desc="" edc:mask="0x1" edc:name="ITL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DSPP" edc:desc="" edc:mask="0x1" edc:name="DSPP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSP2P" edc:desc="" edc:mask="0x1" edc:name="DSP2P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXI" edc:desc="" edc:mask="0x1" edc:name="RXI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ULRI" edc:desc="" edc:mask="0x1" edc:name="ULRI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISA" edc:desc="" edc:mask="0x3" edc:name="ISA" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ISAONEXC" edc:desc="" edc:mask="0x1" edc:name="ISAONEXC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCU" edc:desc="" edc:mask="0x1" edc:name="MCU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MMAR" edc:desc="" edc:mask="0x7" edc:name="MMAR" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IPLW" edc:desc="" edc:mask="0x3" edc:name="IPLW" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-------------------------------" edc:cname="Config4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config4" edc:nmmrflags="0d" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="704">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r------------------------------r" edc:cname="Config5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000001" edc:name="Config5" edc:nmmrflags="0e" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="832">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NF" edc:desc="" edc:mask="0x1" edc:name="NF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="30"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-------------------------------" edc:cname="Config7" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config7" edc:nmmrflags="0" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="1088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="WII" edc:desc="" edc:mask="0x1" edc:name="WII" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----rrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="LLAddr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="LLAddr" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="196">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PAddr" edc:desc="" edc:mask="0xfffffff" edc:name="DSS" edc:nzwidth="0x1C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo1" edc:nmmrflags="0a" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="328">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo2" edc:nmmrflags="0b" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="456">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo3" edc:nmmrflags="0c" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="584">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchHi" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchHi1" edc:nmmrflags="0a" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="332">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchHi2" edc:nmmrflags="0b" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="460">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchHi3" edc:nmmrflags="0c" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="588">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
