Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="----------------------------rrrr" edc:cname="Debug2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Debug2" edc:nmmrflags="0e" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="860">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PACO" edc:desc="" edc:mask="0x1" edc:name="PACO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUP" edc:desc="" edc:mask="0x1" edc:name="TUP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DQ" edc:desc="" edc:mask="0x1" edc:name="DQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRM" edc:desc="" edc:mask="0x1" edc:name="PRM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DEPC" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="224">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEPC" edc:desc="" edc:mask="0xffffffff" edc:name="DEPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UserTraceData2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="UserTraceData2" edc:nmmrflags="0a" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="352">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Data" edc:desc="" edc:mask="0xffffffff" edc:name="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-------------------nnnnnnnnr-nn" edc:cname="PerfCtl0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="PerfCtl0" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="228">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EXL" edc:desc="" edc:mask="0x1" edc:name="EXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="K" edc:desc="" edc:mask="0x1" edc:name="K" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U" edc:desc="" edc:mask="0x1" edc:name="U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVENT" edc:desc="" edc:mask="0x7f" edc:name="EVENT" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PerfCnt0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="PerfCnt0" edc:nmmrflags="0a" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="356">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Counter" edc:desc="" edc:mask="0xffffffff" edc:name="Counter" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-------------------nnnnnnnnr-nn" edc:cname="PerfCtl1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="PerfCtl1" edc:nmmrflags="0b" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="484">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EXL" edc:desc="" edc:mask="0x1" edc:name="EXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="K" edc:desc="" edc:mask="0x1" edc:name="K" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U" edc:desc="" edc:mask="0x1" edc:name="U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVENT" edc:desc="" edc:mask="0x7f" edc:name="EVENT" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PerfCnt1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="PerfCnt1" edc:nmmrflags="0c" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="612">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Counter" edc:desc="" edc:mask="0xffffffff" edc:name="Counter" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--n-----------------------------" edc:cname="ErrCtl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ErrCtl" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="232">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="29"/>
            <edc:SFRFieldDef edc:cname="WST" edc:desc="" edc:mask="0x1" edc:name="WST" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CacheErr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CacheErr" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:nmmrid="236">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Index" edc:desc="" edc:mask="0xfffff" edc:name="Index" edc:nzwidth="20"/>
            <edc:SFRFieldDef edc:cname="Way" edc:desc="" edc:mask="0x3" edc:name="Way" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="EW" edc:desc="" edc:mask="0x1" edc:name="EW" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SP" edc:desc="" edc:mask="0x1" edc:name="SP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EF" edc:desc="" edc:mask="0x1" edc:name="EF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EB" edc:desc="" edc:mask="0x1" edc:name="EB" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EE" edc:desc="" edc:mask="0x1" edc:name="EE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ES" edc:desc="" edc:mask="0x1" edc:name="ES" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ET" edc:desc="" edc:mask="0x1" edc:name="ET" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ED" edc:desc="" edc:mask="0x1" edc:name="ED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EC" edc:desc="" edc:mask="0x1" edc:name="EC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ER" edc:desc="" edc:mask="0x1" edc:name="ER" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
