Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:DCRDef edc:access="---nnnnnnnnnnnnnnnnnnnnn--nnn-nn" edc:cname="ADEVCFG1" edc:default="0x5C3B" edc:desc="" edc:factorydefault="0x1F005C3B" edc:impl="0x1fffff3b" edc:name="ADEVCFG1" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x1FFFFF3B" edc:_addr="0x1FC55E94">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Access Selection" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="JTAG" edc:desc="4-wire JTAG I/F Enabled - EMUC/EMUD Disabled - ICD Module Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="JTAG_ICD" edc:desc="4-wire JTAG I/F Enabled - EMUC/EMUD Disabled - ICD Module Enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="EMUC" edc:desc="EMUC/EMUD Enabled - 4-wire JTAG I/F Disabled - ICD Module Disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EMUC_ICD" edc:desc="EMUC/EMUD Enabled - 4-wire JTAG I/F Disabled - ICD Module Enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="ICESEL" edc:desc="EMUC/EMUD Communication Channel Select" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGx1" edc:desc="ICE EMUC1/EMUD1 pins are shared with PGC1/PGD1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx2" edc:desc="ICE EMUC2/EMUD2 pins are shared with PGC2/PGD2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx3" edc:desc="ICE EMUC3/EMUD3 pins are shared with PGC3/PGD3" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx4" edc:desc="ICE EMUC4/EMUD4 pins are shared with PGC4/PGD4" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="TRCEN" edc:desc="Trace Enable" edc:mask="0x1" edc:name="TRCEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Trace features in the CPU are enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Trace features in the CPU are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:DCRFieldDef edc:cname="FMIIEN" edc:desc="Ethernet RMII/MII Enable" edc:mask="0x1" edc:name="FMIIEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RMII Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="MII Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ETHEXEREF" edc:desc="Exclusive Ethernet PYHY reference clock Enable" edc:mask="0x1" edc:name="ETHEXEREF" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PHY reference clock is made available on ETH EXCLK out" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="ETH CLK out will be used as PHY reference clock if needed" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CLASSBDIS" edc:desc="Disable CLASSB Device Functionality" edc:mask="0x1" edc:name="CLASSBDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ENABLE" edc:desc="CLASSB functions enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DISABLE" edc:desc="CLASSB functions disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="USBIDIO" edc:desc="USB USBID Selection bit" edc:mask="0x1" edc:name="USBIDIO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the USB Module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the Port Function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="VBUSIO" edc:desc="USB VBUS_ON Selection bit" edc:mask="0x1" edc:name="VBUSIO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUS_ON pin is controlled by the USB Module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUS_ON pin is controlled by the Port Function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="HSSPIEN" edc:desc="SPI1 High Speed Mode Enable" edc:mask="0x1" edc:name="HSSPIEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SPI1 is driven from/to dedicated pins, resulting in the highest interface speed" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="SPI1 is driven through PPS (I/O remap), resulting in a lower interface speed" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SMCLR" edc:desc="Selects CRU handling of MCLR Control" edc:mask="0x1" edc:name="SMCLR" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MCLR_NORM" edc:desc="Legacy mode (system clear does not reset all state of device)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MCLR_POR" edc:desc="MCLR causes a faux POR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="HSUARTEN" edc:desc="UART1 High Speed Mode Enable" edc:mask="0x1" edc:name="HSUARTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="UART1 is driven from/to dedicated pins, resulting in the highest possible maximum baud rate" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="UART1 is driven through PPS (I/O remap), resulting in a lower maximum baud rate" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="USBDMTRIM" edc:desc="USB DM Rise/Fall Trim fuse bits" edc:mask="0xf" edc:name="USBDMTRIM" edc:nzwidth="0x4"/>
            <edc:DCRFieldDef edc:cname="USBDPTRIM" edc:desc="USB DP Rise/Fall Trim fuse bits" edc:mask="0xf" edc:name="USBDPTRIM" edc:nzwidth="0x4"/>
            <edc:DCRFieldDef edc:cname="WDTPSS" edc:desc="Watchdog Timer Post-scale Select Sleep bits" edc:mask="0x1f" edc:name="WDTPSS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="PSS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="PSS524288" edc:desc="1:524288" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PSS262144" edc:desc="1:262144" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PSS131072" edc:desc="1:131072" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PSS65536" edc:desc="1:65536" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PSS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PSS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PSS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PSS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PSS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PSS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PSS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PSS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PSS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PSS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PSS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PSS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PSS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PSS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PSS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PSS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnn-nn--nnnnnnnn-nnnn-nn-n" edc:cname="ADEVCFG0" edc:default="0x20800009" edc:desc="" edc:factorydefault="0x30800019" edc:impl="0xffb3fded" edc:name="ADEVCFG0" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffb3fdfd" edc:_addr="0x1FC55E98">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="TDOEN" edc:desc="TDO control for 2 wire JTAG protocol" edc:mask="0x1" edc:name="TDOEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="2-wire JTAG protocol uses TDO" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="2-wire JTAG protocol does not use TDO" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="TROEN" edc:desc="Trace clock control bit" edc:mask="0x1" edc:name="TROEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Start Trace Clock and enable Trace Outputs (Trace Probe must be present)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Stop Trace Clock and disable Trace Outputs" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG control bit" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG port enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG port disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FCPRI" edc:desc="Flash controller RAMa ccess priority" edc:mask="0x1" edc:name="FCPRI" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:desc="flash gets higher priority access to RAM" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LRSA" edc:desc="flash gets least recently used arbitration to RAM" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DMAPRI" edc:desc="DMA RAM access priority" edc:mask="0x1" edc:name="DMAPRI" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:desc="DMA gets High Priority access to SRAM" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LRSA" edc:desc="DMA gets least recently used arbitration to RAM" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EXLPRI" edc:desc="CPU RAM access priority" edc:mask="0x1" edc:name="EXLPRI" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:desc="CPU gets high priority access to RAM" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LRSA" edc:desc="CPU gets least recently used arbitration to RAM" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="USBSSEN" edc:desc="USB Suspend Sleep Enable" edc:mask="0x1" edc:name="USBSSEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USB FREF clock is shut down when suspend mode is active" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USB FREF clock continues to run when suspend mode is active" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="PMULOCK" edc:desc="PMU Controller Register LOCK" edc:mask="0x1" edc:name="PMULOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PMU SFR bits are locked and cannot be modified" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PMU SFR bits are not locked and can be modified" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PGLOCK" edc:desc="Permission Group LOCK" edc:mask="0x1" edc:name="PGLOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="CFGPG SFR bits are locked and cannot be modified" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="CFGPG SFR bits are not locked and can be modified" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PMDLOCK" edc:desc="Peripheral Module Disable (PMD) LOCK" edc:mask="0x1" edc:name="PMDLOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PMDx SFR bits are locked and cannot be modified" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PMDx SFR bits are not locked and can be modified" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOLOCK" edc:desc="IO LOCK" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="IO Remap SFR bits are locked and cannot be modified" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="IO Remap SFR are not locked and can be modified" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CFGLOCK" edc:desc="Configuration Register Lock" edc:mask="0x3" edc:name="CFGLOCK" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="All NVR memory self-writes, BCFG0 and System Config registers, are not locked and can be written - CFGLOCK value can be changed" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON_W" edc:desc="All NVR memory self-writes, BCFG0 and System Config registers, are locked and can not be written - CFGLOCK value can be changed" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="All NVR memory self-writes, BCFG0 and System Config registers, are locked and can not be written - CFGLOCK value can not be changed" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OC_ACLK" edc:desc="OCMP Alternate Clock Selection" edc:mask="0x1" edc:name="OC_ACLK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OCMP_ALT_TMR" edc:desc="OCMP module use an alternative TMR pair as their timebase clock" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OCMP_TMR2_TMR3" edc:desc="All OCMP Modules use TMR2/TMR3 as their timebase clock" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IC_ACLK" edc:desc="ICAP Alternate Clock Selection" edc:mask="0x1" edc:name="IC_ACLK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ICAP_ALT_TMR" edc:desc="ICAP module use an alternative TMR pair as their timebase clock" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ICAP_TMR2_TMR3" edc:desc="All ICAP Modules use TMR2/TMR3 as their timebase clock" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:DCRFieldDef edc:cname="CANFDDIV" edc:desc="CAN-FD divider control" edc:mask="0x3" edc:name="CANFDDIV" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="PCM" edc:desc="P-Cache cache-ability control" edc:mask="0x1" edc:name="PCM" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="CPU" edc:desc="PCHE cache-ability is controlled by CPU" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SFR" edc:desc="PCHE cache-ability is controled by SFR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="UPLLHWMD" edc:desc="UPLL HW Control Mode for power down and RESET" edc:mask="0x1" edc:name="UPLLHWMD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="UPLL PWDN and RESET are generated by HW" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="UPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SPLLHWMD" edc:desc="SPLL HW Control Mode for power down and RESET" edc:mask="0x1" edc:name="SPLLHWMD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SPLL PWDN and RESET are generated by HW" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="SPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BTPLLHWMD" edc:desc="BTPLL HW Control Mode for power down and RESET" edc:mask="0x1" edc:name="BTPLLHWMD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="BTPLL PWDN and RESET are generated by HW" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="BTPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ETHPLLHWMD" edc:desc="Ethernet PLL HW Control Mode for power down and RESET" edc:mask="0x1" edc:name="ETHPLLHWMD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="ETHPLL PWDN and RESET are generated by HW" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="ETHPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FECCCON" edc:desc="Dynamic Flash ECC Configuration" edc:mask="0x3" edc:name="FECCCON" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Flash ECC is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DYNAMIC" edc:desc="Dynamic Flash ECC is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="ECC and Dynamic ECC are disabled" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ETHTPSF" edc:desc="Ethernet Tx SOF control for CTR measurements" edc:mask="0x1" edc:name="ETHTPSF" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="TPSF" edc:desc="TPSF is enabled in CTR measurement" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="RPSF" edc:desc="RPSF is enabled in CTR measurement" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EPGMCLK" edc:desc="External Programming Clock enable" edc:mask="0x1" edc:name="EPGMCLK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="TSTFRC" edc:desc="In ICSP (TMOD0) mode, enable the FRC clock to be driven by the TSTFRC Pin Function" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="In ICSP (TMOD0) mode, the FRC clock is always driven by the FRC oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="----------------------------n-nn" edc:cname="AFBCFG0" edc:default="0x9" edc:desc="FBCFG0" edc:factorydefault="0x8" edc:impl="0xb" edc:name="AFBCFG0" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x8000000B" edc:_addr="0x1FC55E9C">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BUHSWEN" edc:desc="Buck mode switching control" edc:mask="0x1" edc:name="BUHSWEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Buck mode is switched in HW at POR before CPU is allowed to boot" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Buck switching is disabled in HW at POR. Enable from SW" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PCSCMODE" edc:desc="PCache Single cache Mode" edc:mask="0x1" edc:name="PCSCMODE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SINGLE" edc:desc="PCHE ICache Only.CPU Instructions (code, data) go to PCHE ONLY." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DUAL" edc:desc="PCHE ICache and DCache. CPU opcodes go to PCEHE ICache port and data goes to PCHE" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="BOOTISA" edc:desc="Boot and exception code mode" edc:mask="0x1" edc:name="BOOTISA" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MIPS32" edc:desc="Boot code and Exception code is MIPS32" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MICROMIPS" edc:desc="Boot code and Exception code is microMIPS" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1b"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
