Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA3" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA3" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x110" edc:_addr="0x1F800670">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA3" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA3" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA4" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x110" edc:_addr="0x1F800680">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA4" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA4" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA5" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA5" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x110" edc:_addr="0x1F800690">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA5" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA5" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA6" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA6" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x110" edc:_addr="0x1F8006A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA6" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA6" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA7" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA7" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x110" edc:_addr="0x1F8006B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA7" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA7" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMSRCADDR" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMSRCADDR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x110" edc:_addr="0x1F8006C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMSRCADDR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMSRCADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPLT" edc:desc="" edc:impl="0x80ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------000000000000000000000000" edc:name="NVMPWPLT" edc:nzwidth="32" edc:por="1-------000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x110" edc:_addr="0x1F8006D0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWPLT" edc:desc="" edc:mask="0xffffff" edc:name="PWPLT" edc:nzwidth="24"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:desc="" edc:mask="0x1" edc:name="ULOCK" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPGTE" edc:desc="" edc:impl="0x80ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------111111111111111111111111" edc:name="NVMPWPGTE" edc:nzwidth="32" edc:por="1-------111111111111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x110" edc:_addr="0x1F8006E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWPGTE" edc:desc="" edc:mask="0xffffff" edc:name="PWPGTE" edc:nzwidth="24"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:desc="" edc:mask="0x1" edc:name="ULOCK" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMLBWP" edc:desc="" edc:impl="0x80ffff8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------111111111111111111111111" edc:name="NVMLBWP" edc:nzwidth="32" edc:por="1-------111111111111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x110" edc:_addr="0x1F8006F0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LBWP0" edc:mask="0x1" edc:name="LBWP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP1" edc:mask="0x1" edc:name="LBWP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP2" edc:mask="0x1" edc:name="LBWP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP3" edc:mask="0x1" edc:name="LBWP3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP4" edc:mask="0x1" edc:name="LBWP4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP5" edc:mask="0x1" edc:name="LBWP5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP6" edc:mask="0x1" edc:name="LBWP6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP7" edc:mask="0x1" edc:name="LBWP7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP8" edc:mask="0x1" edc:name="LBWP8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP9" edc:mask="0x1" edc:name="LBWP9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP10" edc:mask="0x1" edc:name="LBWP10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP11" edc:mask="0x1" edc:name="LBWP11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP12" edc:mask="0x1" edc:name="LBWP12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP13" edc:mask="0x1" edc:name="LBWP13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP14" edc:mask="0x1" edc:name="LBWP14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP15" edc:mask="0x1" edc:name="LBWP15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP16" edc:mask="0x1" edc:name="LBWP16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP17" edc:mask="0x1" edc:name="LBWP17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP18" edc:mask="0x1" edc:name="LBWP18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP19" edc:mask="0x1" edc:name="LBWP19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP20" edc:mask="0x1" edc:name="LBWP20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP21" edc:mask="0x1" edc:name="LBWP21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP22" edc:mask="0x1" edc:name="LBWP22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP23" edc:mask="0x1" edc:name="LBWP23" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:mask="0x1" edc:name="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="r-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMUBWP" edc:desc="" edc:impl="0x80ffff8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------111111111111111111111111" edc:name="NVMUBWP" edc:nzwidth="32" edc:por="1-------111111111111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x110" edc:_addr="0x1F800700">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UBWP0" edc:mask="0x1" edc:name="UBWP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP1" edc:mask="0x1" edc:name="UBWP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP2" edc:mask="0x1" edc:name="UBWP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP3" edc:mask="0x1" edc:name="UBWP3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP4" edc:mask="0x1" edc:name="UBWP4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP5" edc:mask="0x1" edc:name="UBWP5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP6" edc:mask="0x1" edc:name="UBWP6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP7" edc:mask="0x1" edc:name="UBWP7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP8" edc:mask="0x1" edc:name="UBWP8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP9" edc:mask="0x1" edc:name="UBWP9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP10" edc:mask="0x1" edc:name="UBWP10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP11" edc:mask="0x1" edc:name="UBWP11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP12" edc:mask="0x1" edc:name="UBWP12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP13" edc:mask="0x1" edc:name="UBWP13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP14" edc:mask="0x1" edc:name="UBWP14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP15" edc:mask="0x1" edc:name="UBWP15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP16" edc:mask="0x1" edc:name="UBWP16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP17" edc:mask="0x1" edc:name="UBWP17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP18" edc:mask="0x1" edc:name="UBWP18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP19" edc:mask="0x1" edc:name="UBWP19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP20" edc:mask="0x1" edc:name="UBWP20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP21" edc:mask="0x1" edc:name="UBWP21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP22" edc:mask="0x1" edc:name="UBWP22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP23" edc:mask="0x1" edc:name="UBWP23" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:mask="0x1" edc:name="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
