Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:AdjustPoint edc:offset="0xf0" edc:_addr="0x1F800710"/>
      <edc:SFRDef edc:access="wwwwwwwwwwwwwwwwn--rrrrrrrrrrrrn" edc:cname="WDTCON" edc:desc="" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000x--xxxxxxxxxxxx0" edc:name="WDTCON" edc:nzwidth="32" edc:por="0000000000000000x--xxxxxxxxxxxx0" edc:portals="CLR SET INV" ltx:baseofperipheral="WDT" edc:_modsrc="DOS-02674_wdt_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1F800800">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDTWINEN" edc:desc="" edc:mask="0x1" edc:name="WDTWINEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPDIV" edc:desc="" edc:mask="0x1f" edc:name="SLPDIV" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x3" edc:name="CLKSEL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RUNDIV" edc:desc="" edc:mask="0x1f" edc:name="RUNDIV" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTCLRKEY" edc:desc="" edc:mask="0xffff" edc:name="WDTCLRKEY" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1f0" edc:_addr="0x1F800810"/>
      <edc:SFRDef edc:access="----------------n---------------" edc:cname="DMTCON" edc:desc="" edc:impl="0x8000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---------------" edc:name="DMTCON" edc:nzwidth="32" edc:por="----------------0---------------" edc:portals="- - -" ltx:baseofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x80" edc:_addr="0x1F800A00">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="15"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnn--------" edc:cname="DMTPRECLR" edc:desc="" edc:impl="0xff00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00000000--------" edc:name="DMTPRECLR" edc:nzwidth="32" edc:por="----------------00000000--------" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x80" edc:_addr="0x1F800A10">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="STEP1" edc:desc="" edc:mask="0xff" edc:name="STEP1" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------nnnnnnnn" edc:cname="DMTCLR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="DMTCLR" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x80" edc:_addr="0x1F800A20">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP2" edc:desc="" edc:mask="0xff" edc:name="STEP2" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------rrr----r" edc:cname="DMTSTAT" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------000----0" edc:name="DMTSTAT" edc:nzwidth="32" edc:por="------------------------000----0" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x80" edc:_addr="0x1F800A30">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WINOPN" edc:desc="" edc:mask="0x1" edc:name="WINOPN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DMTEVENT" edc:desc="" edc:mask="0x1" edc:name="DMTEVENT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BAD" edc:desc="" edc:mask="0x3" edc:name="BAD" edc:nzwidth="2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="BAD2" edc:desc="" edc:mask="0x1" edc:name="BAD2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BAD1" edc:desc="" edc:mask="0x1" edc:name="BAD1" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMTCNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DMTCNT" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x80" edc:_addr="0x1F800A40">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="" edc:mask="0xffffffff" edc:name="COUNTER" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="DMTHOLDREG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DMTHOLDREG" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x80" edc:_addr="0x1F800A50">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UPRCNT" edc:desc="" edc:mask="0xffff" edc:name="UPRCNT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMTPSCNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DMTPSCNT" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x80" edc:_addr="0x1F800A60">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PSCNT" edc:desc="" edc:mask="0xffffffff" edc:name="PSCNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMTPSINTV" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DMTPSINTV" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="DMT" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x80" edc:_addr="0x1F800A70">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PSINTV" edc:desc="" edc:mask="0xffffffff" edc:name="PSINTV" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
