Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:AdjustPoint edc:offset="0x780" edc:_addr="0x1F800A80"/>
      <edc:SFRDef edc:access="-----nnnn-n-----rrrrnnnnn--nnnnn" edc:cname="OSCCON" edc:desc="" edc:impl="0x7a0ff9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0000-u-----0000xxxx0--000x0" edc:name="OSCCON" edc:nzwidth="32" edc:por="-----0000-x-----0000xxxx0--000x0" edc:portals="CLR SET INV" ltx:baseofperipheral="CRU" edc:_addr="0x1F801200">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UFRCEN" edc:desc="" edc:mask="0x1" edc:name="UFRCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CLKLOCK" edc:desc="" edc:mask="0x1" edc:name="CLKLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0xf" edc:name="NOSC" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0xf" edc:name="COSC" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="WAKE2SPD" edc:mask="0x1" edc:name="WAKE2SPD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DRMEN" edc:desc="" edc:mask="0x1" edc:name="DRMEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRCDIV" edc:desc="" edc:mask="0x7" edc:name="FRCDIV" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------------nnnnnn" edc:cname="OSCTUN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000000" edc:name="OSCTUN" edc:nzwidth="32" edc:por="--------------------------000000" edc:portals="CLR SET INV" ltx:baseofperipheral="CRU" edc:_addr="0x1F801210">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x3f" edc:name="TUN" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnn-nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPLLCON" edc:desc="" edc:impl="0xefffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-uuuuuuuuuuuuuuuuuuuuuuuuuxxx" edc:name="SPLLCON" edc:nzwidth="32" edc:por="xxx-xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="CRU" edc:_addr="0x1F801220">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPLLBSWSEL" edc:desc="" edc:mask="0x7" edc:name="SPLLBSWSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="SPLLPWDN" edc:mask="0x1" edc:name="SPLLPWDN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLPOSTDIV1" edc:mask="0x3f" edc:name="SPLLPOSTDIV1" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SPLLFLOCK" edc:mask="0x1" edc:name="SPLLFLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLRST" edc:mask="0x1" edc:name="SPLLRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLFBDIV" edc:mask="0x3ff" edc:name="SPLLFBDIV" edc:nzwidth="0xa"/>
            <edc:SFRFieldDef edc:cname="SPLLREFDIV" edc:mask="0x3f" edc:name="SPLLREFDIV" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOCK" edc:mask="0x1" edc:name="SLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLICLK" edc:mask="0x1" edc:name="SPLLICLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLL_BYP" edc:mask="0x1" edc:name="SPLL_BYP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n-n-nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UPLLCON" edc:desc="" edc:impl="0xafffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u-u-uuuuuuuuuuuuuuuuuuuuuuuuuxxx" edc:name="UPLLCON" edc:nzwidth="32" edc:por="x-x-xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" edc:_addr="0x1F801230">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UPLLBSWSEL" edc:desc="" edc:mask="0x7" edc:name="UPLLBSWSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="UPLLPWDN" edc:mask="0x1" edc:name="UPLLPWDN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPLLPOSTDIV1" edc:mask="0x3f" edc:name="UPLLPOSTDIV1" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="UPLLFLOCK" edc:mask="0x1" edc:name="UPLLFLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPLLRST" edc:mask="0x1" edc:name="UPLLRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPLLFBDIV" edc:mask="0x3ff" edc:name="UPLLFBDIV" edc:nzwidth="0xa"/>
            <edc:SFRFieldDef edc:cname="UPLLREFDIV" edc:mask="0x3f" edc:name="UPLLREFDIV" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:mask="0x1" edc:name="ULOCK" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="UPLL_BYP" edc:mask="0x1" edc:name="UPLL_BYP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BTPLLCON" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuxxx" edc:name="BTPLLCON" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" edc:_addr="0x1F801240">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BTPLLBSWSEL" edc:desc="" edc:mask="0x7" edc:name="BTPLLBSWSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="BTPLLPWDN" edc:mask="0x1" edc:name="BTPLLPWDN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLLPOSTDIV1" edc:mask="0x3f" edc:name="BTPLLPOSTDIV1" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="BTPLLFLOCK" edc:mask="0x1" edc:name="BTPLLFLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLLRST" edc:mask="0x1" edc:name="BTPLLRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLLFBDIV" edc:mask="0x3ff" edc:name="BTPLLFBDIV" edc:nzwidth="0xa"/>
            <edc:SFRFieldDef edc:cname="BTPLLREFDIV" edc:mask="0x3f" edc:name="BTPLLREFDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="BTCLKOUTEN" edc:mask="0x1" edc:name="BTCLKOUTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTLOCK" edc:mask="0x1" edc:name="BTLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLLCLK" edc:mask="0x1" edc:name="BTPLLCLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLL_BYP" edc:mask="0x1" edc:name="BTPLL_BYP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
