Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGL0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGL0" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801C90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGL0" edc:mask="0xffff" edc:name="PTGL0" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="PTGQPTR" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------xxxxx" edc:name="PTGQPTR" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801CA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGQPTR" edc:mask="0x1f" edc:name="PTGQPTR" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801CB0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801CC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP0" edc:mask="0xff" edc:name="STEP0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP1" edc:mask="0xff" edc:name="STEP1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP2" edc:mask="0xff" edc:name="STEP2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP3" edc:mask="0xff" edc:name="STEP3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801CD0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP4" edc:mask="0xff" edc:name="STEP4" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP5" edc:mask="0xff" edc:name="STEP5" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP6" edc:mask="0xff" edc:name="STEP6" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP7" edc:mask="0xff" edc:name="STEP7" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801CE0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP8" edc:mask="0xff" edc:name="STEP8" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP9" edc:mask="0xff" edc:name="STEP9" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP10" edc:mask="0xff" edc:name="STEP10" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP11" edc:mask="0xff" edc:name="STEP11" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE3" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801CF0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP12" edc:mask="0xff" edc:name="STEP12" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP13" edc:mask="0xff" edc:name="STEP13" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP14" edc:mask="0xff" edc:name="STEP14" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP15" edc:mask="0xff" edc:name="STEP15" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE4" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801D00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP16" edc:mask="0xff" edc:name="STEP16" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP17" edc:mask="0xff" edc:name="STEP17" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP18" edc:mask="0xff" edc:name="STEP18" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP19" edc:mask="0xff" edc:name="STEP19" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE5" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801D10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP20" edc:mask="0xff" edc:name="STEP20" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP21" edc:mask="0xff" edc:name="STEP21" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP22" edc:mask="0xff" edc:name="STEP22" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP23" edc:mask="0xff" edc:name="STEP23" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE6" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE6" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801D20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP24" edc:mask="0xff" edc:name="STEP24" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP25" edc:mask="0xff" edc:name="STEP25" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP26" edc:mask="0xff" edc:name="STEP26" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP27" edc:mask="0xff" edc:name="STEP27" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE7" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE7" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F801D30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP28" edc:mask="0xff" edc:name="STEP28" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP29" edc:mask="0xff" edc:name="STEP29" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP30" edc:mask="0xff" edc:name="STEP30" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP31" edc:mask="0xff" edc:name="STEP31" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
