Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnn-----nnnnnnnnnnnnnnnn" edc:cname="IFS1" edc:desc="" edc:impl="0xffe0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu000000000-----00000000000000u0" edc:name="IFS1" edc:nzwidth="32" edc:por="xx000000000-----00000000000000x0" edc:portals="CLR SET INV" edc:_addr="0x1F810050">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFWCRCIF" edc:desc="" edc:mask="0x1" edc:name="PFWCRCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIF" edc:desc="" edc:mask="0x1" edc:name="USBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNKIF" edc:desc="" edc:mask="0x1" edc:name="CNKIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIF" edc:desc="" edc:mask="0x1" edc:name="I2C2BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIF" edc:desc="" edc:mask="0x1" edc:name="I2C2SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIF" edc:desc="" edc:mask="0x1" edc:name="I2C2MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3EIF" edc:mask="0x1" edc:name="U3EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3RXIF" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn---nnnnnnnnn---n" edc:cname="IFS2" edc:desc="" edc:impl="0xffff1ff1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000u000---000000000---u" edc:name="IFS2" edc:nzwidth="32" edc:por="000000000000x000---000000000---x" edc:portals="CLR SET INV" edc:_addr="0x1F810060">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIF" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IF" edc:desc="" edc:mask="0x1" edc:name="DMA4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IF" edc:desc="" edc:mask="0x1" edc:name="DMA5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IF" edc:desc="" edc:mask="0x1" edc:name="DMA6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IF" edc:desc="" edc:mask="0x1" edc:name="DMA7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IF" edc:desc="" edc:mask="0x1" edc:name="T6IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T7IF" edc:desc="" edc:mask="0x1" edc:name="T7IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RFSMCIF" edc:mask="0x1" edc:name="RFSMCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFMACIF" edc:desc="" edc:mask="0x1" edc:name="RFMACIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTR1EVIF" edc:desc="" edc:mask="0x1" edc:name="CTR1EVIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM0IF" edc:desc="" edc:mask="0x1" edc:name="RFTM0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM1IF" edc:desc="" edc:mask="0x1" edc:name="RFTM1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM2IF" edc:desc="" edc:mask="0x1" edc:name="RFTM2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM3IF" edc:desc="" edc:mask="0x1" edc:name="RFTM3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTR1TRGIF" edc:desc="" edc:mask="0x1" edc:name="CTR1TRGIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFWCOEIF" edc:desc="" edc:mask="0x1" edc:name="RFWCOEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCIF" edc:desc="" edc:mask="0x1" edc:name="ADCIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC1IF" edc:desc="" edc:mask="0x1" edc:name="ADCDC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC2IF" edc:desc="" edc:mask="0x1" edc:name="ADCDC2IF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnn-nnnnnnnnnnnn" edc:cname="IFS3" edc:desc="" edc:impl="0xffffefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu00000000000000000-000000000000" edc:name="IFS3" edc:nzwidth="32" edc:por="xx00000000000000000-000000000000" edc:portals="CLR SET INV" edc:_addr="0x1F810070">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDF1IF" edc:desc="" edc:mask="0x1" edc:name="ADCDF1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IF" edc:desc="" edc:mask="0x1" edc:name="ADCDF2IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIF" edc:desc="" edc:mask="0x1" edc:name="ADCFLTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCEOSIF" edc:desc="" edc:mask="0x1" edc:name="ADCEOSIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCARDYIF" edc:desc="" edc:mask="0x1" edc:name="ADCARDYIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCURDYIF" edc:desc="" edc:mask="0x1" edc:name="ADCURDYIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCFCBTIF" edc:desc="" edc:mask="0x1" edc:name="ADCFCBTIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCD0IF" edc:desc="" edc:mask="0x1" edc:name="ADCD0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD1IF" edc:desc="" edc:mask="0x1" edc:name="ADCD1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD2IF" edc:desc="" edc:mask="0x1" edc:name="ADCD2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD3IF" edc:desc="" edc:mask="0x1" edc:name="ADCD3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD4IF" edc:desc="" edc:mask="0x1" edc:name="ADCD4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD5IF" edc:desc="" edc:mask="0x1" edc:name="ADCD5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD6IF" edc:desc="" edc:mask="0x1" edc:name="ADCD6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD7IF" edc:desc="" edc:mask="0x1" edc:name="ADCD7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD8IF" edc:desc="" edc:mask="0x1" edc:name="ADCD8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD9IF" edc:desc="" edc:mask="0x1" edc:name="ADCD9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD10IF" edc:desc="" edc:mask="0x1" edc:name="ADCD10IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD11IF" edc:desc="" edc:mask="0x1" edc:name="ADCD11IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD12IF" edc:desc="" edc:mask="0x1" edc:name="ADCD12IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD13IF" edc:desc="" edc:mask="0x1" edc:name="ADCD13IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD14IF" edc:desc="" edc:mask="0x1" edc:name="ADCD14IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD15IF" edc:desc="" edc:mask="0x1" edc:name="ADCD15IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD16IF" edc:desc="" edc:mask="0x1" edc:name="ADCD16IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD17IF" edc:desc="" edc:mask="0x1" edc:name="ADCD17IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD18IF" edc:desc="" edc:mask="0x1" edc:name="ADCD18IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD19IF" edc:desc="" edc:mask="0x1" edc:name="ADCD19IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD20IF" edc:mask="0x1" edc:name="ADCD20IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD21IF" edc:mask="0x1" edc:name="ADCD21IF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000uuu0000000000000uu" edc:name="IFS4" edc:nzwidth="32" edc:por="00000000000000xxx0000000000000xx" edc:portals="CLR SET INV" edc:_addr="0x1F810080">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD22IF" edc:mask="0x1" edc:name="ADCD22IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD23IF" edc:mask="0x1" edc:name="ADCD23IF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xc"/>
            <edc:SFRFieldDef edc:cname="CAN1IF" edc:desc="" edc:mask="0x1" edc:name="CAN1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2RXIF" edc:mask="0x1" edc:name="CAN2RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN2TXIF" edc:mask="0x1" edc:name="CAN2TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN2IF" edc:mask="0x1" edc:name="CAN2IF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SQIIF" edc:desc="" edc:mask="0x1" edc:name="SQIIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PTGSTEPIF" edc:desc="" edc:mask="0x1" edc:name="PTGSTEPIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTGWDTIF" edc:desc="" edc:mask="0x1" edc:name="PTGWDTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR0IF" edc:desc="" edc:mask="0x1" edc:name="PTG0TR0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR1IF" edc:desc="" edc:mask="0x1" edc:name="PTG0TR1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR2IF" edc:desc="" edc:mask="0x1" edc:name="PTG0TR2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR3IF" edc:desc="" edc:mask="0x1" edc:name="PTG0TR3IF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
