Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000u000000000000000000u" edc:name="IEC2" edc:nzwidth="32" edc:por="000000000000x000000000000000000x" edc:portals="CLR SET INV" edc:_addr="0x1F8100E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIE" edc:mask="0x1" edc:name="U3TXIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA0IE" edc:desc="" edc:mask="0x1" edc:name="DMA0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IE" edc:desc="" edc:mask="0x1" edc:name="DMA1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IE" edc:desc="" edc:mask="0x1" edc:name="DMA2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IE" edc:desc="" edc:mask="0x1" edc:name="DMA3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IE" edc:desc="" edc:mask="0x1" edc:name="DMA4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IE" edc:desc="" edc:mask="0x1" edc:name="DMA5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IE" edc:desc="" edc:mask="0x1" edc:name="DMA6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IE" edc:desc="" edc:mask="0x1" edc:name="DMA7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IE" edc:desc="" edc:mask="0x1" edc:name="T6IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T7IE" edc:desc="" edc:mask="0x1" edc:name="T7IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RFSMCIE" edc:mask="0x1" edc:name="RFSMCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFMACIE" edc:desc="" edc:mask="0x1" edc:name="RFMACIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTREVIE" edc:desc="" edc:mask="0x1" edc:name="CTREVIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM0IE" edc:desc="" edc:mask="0x1" edc:name="RFTM0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM1IE" edc:desc="" edc:mask="0x1" edc:name="RFTM1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM2IE" edc:desc="" edc:mask="0x1" edc:name="RFTM2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM3IE" edc:desc="" edc:mask="0x1" edc:name="RFTM3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTRTRGIE" edc:desc="" edc:mask="0x1" edc:name="CTRTRGIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFWCOEIE" edc:desc="" edc:mask="0x1" edc:name="RFWCOEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCIE" edc:desc="" edc:mask="0x1" edc:name="ADCIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC1IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC2IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC2IE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnn-nnnnnnnnnnnn" edc:cname="IEC3" edc:desc="" edc:impl="0xffffefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu00000000000000000-000000000000" edc:name="IEC3" edc:nzwidth="32" edc:por="xx00000000000000000-000000000000" edc:portals="CLR SET INV" edc:_addr="0x1F8100F0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDF1IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF2IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIE" edc:desc="" edc:mask="0x1" edc:name="ADCFLTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCEOSIE" edc:desc="" edc:mask="0x1" edc:name="ADCEOSIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCARDYIE" edc:desc="" edc:mask="0x1" edc:name="ADCARDYIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCURDYIE" edc:desc="" edc:mask="0x1" edc:name="ADCURDYIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCFCBTIE" edc:desc="" edc:mask="0x1" edc:name="ADCFCBTIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCD0IE" edc:desc="" edc:mask="0x1" edc:name="ADCD0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD1IE" edc:desc="" edc:mask="0x1" edc:name="ADCD1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD2IE" edc:desc="" edc:mask="0x1" edc:name="ADCD2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD3IE" edc:desc="" edc:mask="0x1" edc:name="ADCD3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD4IE" edc:desc="" edc:mask="0x1" edc:name="ADCD4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD5IE" edc:desc="" edc:mask="0x1" edc:name="ADCD5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD6IE" edc:desc="" edc:mask="0x1" edc:name="ADCD6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD7IE" edc:desc="" edc:mask="0x1" edc:name="ADCD7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD8IE" edc:desc="" edc:mask="0x1" edc:name="ADCD8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD9IE" edc:desc="" edc:mask="0x1" edc:name="ADCD9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD10IE" edc:desc="" edc:mask="0x1" edc:name="ADCD10IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD11IE" edc:desc="" edc:mask="0x1" edc:name="ADCD11IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD12IE" edc:desc="" edc:mask="0x1" edc:name="ADCD12IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD13IE" edc:desc="" edc:mask="0x1" edc:name="ADCD13IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD14IE" edc:desc="" edc:mask="0x1" edc:name="ADCD14IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD15IE" edc:desc="" edc:mask="0x1" edc:name="ADCD15IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD16IE" edc:desc="" edc:mask="0x1" edc:name="ADCD16IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD17IE" edc:desc="" edc:mask="0x1" edc:name="ADCD17IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD18IE" edc:desc="" edc:mask="0x1" edc:name="ADCD18IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD19IE" edc:desc="" edc:mask="0x1" edc:name="ADCD19IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD20IE" edc:mask="0x1" edc:name="ADCD20IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD21IE" edc:mask="0x1" edc:name="ADCD21IE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000uuu0000000000000uu" edc:name="IEC4" edc:nzwidth="32" edc:por="00000000000000xxx0000000000000xx" edc:portals="CLR SET INV" edc:_addr="0x1F810100">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD22IE" edc:mask="0x1" edc:name="ADCD22IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD23IE" edc:mask="0x1" edc:name="ADCD23IE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xc"/>
            <edc:SFRFieldDef edc:cname="CAN1IE" edc:desc="" edc:mask="0x1" edc:name="CAN1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2RXIE" edc:mask="0x1" edc:name="CAN2RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN2TXIE" edc:mask="0x1" edc:name="CAN2TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN2IE" edc:mask="0x1" edc:name="CAN2IE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SQIIE" edc:desc="" edc:mask="0x1" edc:name="SQIIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PTGSTEPIE" edc:desc="" edc:mask="0x1" edc:name="PTGSTEPIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTGWDTIE" edc:desc="" edc:mask="0x1" edc:name="PTGWDTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR0IE" edc:desc="" edc:mask="0x1" edc:name="PTG0TR0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR1IE" edc:desc="" edc:mask="0x1" edc:name="PTG0TR1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR2IE" edc:desc="" edc:mask="0x1" edc:name="PTG0TR2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR3IE" edc:desc="" edc:mask="0x1" edc:name="PTG0TR3IE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC5" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000000uuuu0000" edc:name="IEC5" edc:nzwidth="32" edc:por="-00000000000000000000000xxxx0000" edc:portals="CLR SET INV" edc:_addr="0x1F810110">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="MPUPCIE" edc:desc="" edc:mask="0x1" edc:name="MPUPCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FDCIE" edc:desc="" edc:mask="0x1" edc:name="FDCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CRPTIE" edc:mask="0x1" edc:name="CRPTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETHIE" edc:mask="0x1" edc:name="ETHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRPT1IE" edc:mask="0x1" edc:name="CRPT1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRPT1EIE" edc:mask="0x1" edc:name="CRPT1EIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="32" edc:_addr="0x1F810120"/>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC0" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810140">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIS" edc:desc="" edc:mask="0x3" edc:name="CTIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CTIP" edc:desc="" edc:mask="0x7" edc:name="CTIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CS0IS" edc:desc="" edc:mask="0x3" edc:name="CS0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CS0IP" edc:desc="" edc:mask="0x7" edc:name="CS0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CS1IS" edc:desc="" edc:mask="0x3" edc:name="CS1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CS1IP" edc:desc="" edc:mask="0x7" edc:name="CS1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT0IS" edc:desc="" edc:mask="0x3" edc:name="INT0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT0IP" edc:desc="" edc:mask="0x7" edc:name="INT0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC1" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810150">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1IS" edc:desc="" edc:mask="0x3" edc:name="T1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T1IP" edc:desc="" edc:mask="0x7" edc:name="T1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC1EIS" edc:desc="" edc:mask="0x3" edc:name="IC1EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC1EIP" edc:desc="" edc:mask="0x7" edc:name="IC1EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC1IS" edc:desc="" edc:mask="0x3" edc:name="IC1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC1IP" edc:desc="" edc:mask="0x7" edc:name="IC1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC1IS" edc:desc="" edc:mask="0x3" edc:name="OC1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC1IP" edc:desc="" edc:mask="0x7" edc:name="OC1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC2" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810160">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT1IS" edc:desc="" edc:mask="0x3" edc:name="INT1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT1IP" edc:desc="" edc:mask="0x7" edc:name="INT1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T2IS" edc:desc="" edc:mask="0x3" edc:name="T2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T2IP" edc:desc="" edc:mask="0x7" edc:name="T2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC2EIS" edc:desc="" edc:mask="0x3" edc:name="IC2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC2EIP" edc:desc="" edc:mask="0x7" edc:name="IC2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC2IS" edc:desc="" edc:mask="0x3" edc:name="IC2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC2IP" edc:desc="" edc:mask="0x7" edc:name="IC2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC3" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810170">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OC2IS" edc:desc="" edc:mask="0x3" edc:name="OC2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC2IP" edc:desc="" edc:mask="0x7" edc:name="OC2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT2IS" edc:desc="" edc:mask="0x3" edc:name="INT2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT2IP" edc:desc="" edc:mask="0x7" edc:name="INT2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T3IS" edc:desc="" edc:mask="0x3" edc:name="T3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T3IP" edc:desc="" edc:mask="0x7" edc:name="T3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC3EIS" edc:desc="" edc:mask="0x3" edc:name="IC3EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC3EIP" edc:desc="" edc:mask="0x7" edc:name="IC3EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC4" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810180">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC3IS" edc:desc="" edc:mask="0x3" edc:name="IC3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC3IP" edc:desc="" edc:mask="0x7" edc:name="IC3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC3IS" edc:desc="" edc:mask="0x3" edc:name="OC3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC3IP" edc:desc="" edc:mask="0x7" edc:name="OC3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT3IS" edc:desc="" edc:mask="0x3" edc:name="INT3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT3IP" edc:desc="" edc:mask="0x7" edc:name="INT3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T4IS" edc:desc="" edc:mask="0x3" edc:name="T4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T4IP" edc:desc="" edc:mask="0x7" edc:name="T4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC5" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810190">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC4EIS" edc:desc="" edc:mask="0x3" edc:name="IC4EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC4EIP" edc:desc="" edc:mask="0x7" edc:name="IC4EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC4IS" edc:desc="" edc:mask="0x3" edc:name="IC4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC4IP" edc:desc="" edc:mask="0x7" edc:name="IC4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC4IS" edc:desc="" edc:mask="0x3" edc:name="OC4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC4IP" edc:desc="" edc:mask="0x7" edc:name="OC4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT4IS" edc:desc="" edc:mask="0x3" edc:name="INT4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT4IP" edc:desc="" edc:mask="0x7" edc:name="INT4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="IPC6" edc:desc="" edc:impl="0xe0e0e0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="IPC6" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV" edc:_addr="0x1F8101A0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T5IS" edc:desc="" edc:mask="0x3" edc:name="T5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T5IP" edc:desc="" edc:mask="0x7" edc:name="T5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="21"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
