Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC18" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC18" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810260">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA4IS" edc:desc="" edc:mask="0x3" edc:name="DMA4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA4IP" edc:desc="" edc:mask="0x7" edc:name="DMA4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA5IS" edc:desc="" edc:mask="0x3" edc:name="DMA5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA5IP" edc:desc="" edc:mask="0x7" edc:name="DMA5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA6IS" edc:desc="" edc:mask="0x3" edc:name="DMA6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA6IP" edc:desc="" edc:mask="0x7" edc:name="DMA6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA7IS" edc:desc="" edc:mask="0x3" edc:name="DMA7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA7IP" edc:desc="" edc:mask="0x7" edc:name="DMA7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="IPC19" edc:desc="" edc:impl="0xe0e0e0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="IPC19" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV" edc:_addr="0x1F810270">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T6IS" edc:desc="" edc:mask="0x3" edc:name="T6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T6IP" edc:desc="" edc:mask="0x7" edc:name="T6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="21"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn-------------------nnnnn" edc:cname="IPC20" edc:desc="" edc:impl="0xffe0e0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu-------------------00000" edc:name="IPC20" edc:nzwidth="32" edc:por="---xxxxx-------------------00000" edc:portals="CLR SET INV" edc:_addr="0x1F810280">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T7IS" edc:desc="" edc:mask="0x3" edc:name="T7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T7IP" edc:desc="" edc:mask="0x7" edc:name="T7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="RFSMCIS" edc:mask="0x3" edc:name="RFSMCIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RFSMCIP" edc:mask="0x7" edc:name="RFSMCIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC21" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC21" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810290">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RFMACIS" edc:desc="" edc:mask="0x3" edc:name="RFMACIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFMACIP" edc:desc="" edc:mask="0x7" edc:name="RFMACIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CTREVIS" edc:desc="" edc:mask="0x3" edc:name="CTREVIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CTREVIP" edc:desc="" edc:mask="0x7" edc:name="CTREVIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RFTM0IS" edc:desc="" edc:mask="0x3" edc:name="RFTM0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFTM0IP" edc:desc="" edc:mask="0x7" edc:name="RFTM0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RFTM1IS" edc:desc="" edc:mask="0x3" edc:name="RFTM1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFTM1IP" edc:desc="" edc:mask="0x7" edc:name="RFTM1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC22" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC22" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F8102A0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RFTM2IS" edc:desc="" edc:mask="0x3" edc:name="RFTM2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFTM2IP" edc:desc="" edc:mask="0x7" edc:name="RFTM2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RFTM3IS" edc:desc="" edc:mask="0x3" edc:name="RFTM3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFTM3IP" edc:desc="" edc:mask="0x7" edc:name="RFTM3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CTRTRGIS" edc:desc="" edc:mask="0x3" edc:name="CTRTRGIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CTRTRGIP" edc:desc="" edc:mask="0x7" edc:name="CTRTRGIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RFWCOEIS" edc:desc="" edc:mask="0x3" edc:name="RFWCOEIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFWCOEIP" edc:desc="" edc:mask="0x7" edc:name="RFWCOEIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
