Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC29" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC29" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810310">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1I10IS" edc:desc="" edc:mask="0x3" edc:name="AD1I10IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I10IP" edc:desc="" edc:mask="0x7" edc:name="AD1I10IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I11IS" edc:desc="" edc:mask="0x3" edc:name="AD1I11IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I11IP" edc:desc="" edc:mask="0x7" edc:name="AD1I11IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I12IS" edc:desc="" edc:mask="0x3" edc:name="AD1I12IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I12IP" edc:desc="" edc:mask="0x7" edc:name="AD1I12IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I13IS" edc:desc="" edc:mask="0x3" edc:name="AD1I13IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I13IP" edc:desc="" edc:mask="0x7" edc:name="AD1I13IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC30" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC30" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810320">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1I14IS" edc:desc="" edc:mask="0x3" edc:name="AD1I14IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I14IP" edc:desc="" edc:mask="0x7" edc:name="AD1I14IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I15IS" edc:desc="" edc:mask="0x3" edc:name="AD1I15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I15IP" edc:desc="" edc:mask="0x7" edc:name="AD1I15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I16IS" edc:desc="" edc:mask="0x3" edc:name="AD1I16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I16IP" edc:desc="" edc:mask="0x7" edc:name="AD1I16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I17IS" edc:desc="" edc:mask="0x3" edc:name="AD1I17IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I17IP" edc:desc="" edc:mask="0x7" edc:name="AD1I17IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC31" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---00000---00000" edc:name="IPC31" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---00000---00000" edc:portals="CLR SET INV" edc:_addr="0x1F810330">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1I18IS" edc:desc="" edc:mask="0x3" edc:name="AD1I18IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I18IP" edc:desc="" edc:mask="0x7" edc:name="AD1I18IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I19IS" edc:desc="" edc:mask="0x3" edc:name="AD1I19IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I19IP" edc:desc="" edc:mask="0x7" edc:name="AD1I19IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AD1I20IS" edc:mask="0x3" edc:name="AD1I20IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I20IP" edc:mask="0x7" edc:name="AD1I20IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AD1I21IS" edc:mask="0x3" edc:name="AD1I21IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I21IP" edc:mask="0x7" edc:name="AD1I21IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC32" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuu---uuuuu" edc:name="IPC32" edc:nzwidth="32" edc:por="-------------------xxxxx---xxxxx" edc:portals="CLR SET INV" edc:_addr="0x1F810340">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1I22IS" edc:mask="0x3" edc:name="AD1I22IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I22IP" edc:mask="0x7" edc:name="AD1I22IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AD1I23IS" edc:mask="0x3" edc:name="AD1I23IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I23IP" edc:mask="0x7" edc:name="AD1I23IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x1F810350"/>
      <edc:SFRDef edc:access="---nnnnn---nnnnn----------------" edc:cname="IPC35" edc:desc="" edc:impl="0xffffe0e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---00000----------------" edc:name="IPC35" edc:nzwidth="32" edc:por="---xxxxx---00000----------------" edc:portals="CLR SET INV" edc:_addr="0x1F810370">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="CAN1IS" edc:desc="" edc:mask="0x3" edc:name="CAN1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN1IP" edc:desc="" edc:mask="0x7" edc:name="CAN1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CAN2RXIS" edc:mask="0x3" edc:name="CAN2RXIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CAN2RXIP" edc:mask="0x7" edc:name="CAN2RXIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
