Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:AdjustPoint edc:offset="0x19c0" edc:_addr="0x1F812440"/>
      <edc:SFRDef edc:access="nn-----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMUSPICTRL" edc:desc="" edc:impl="0xc1ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-----uuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="PMUSPICTRL" edc:nzwidth="32" edc:por="xx-----xxxxxxxxxxxxxxxxxxxxxxxxx" edc:_addr="0x1F813E00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPIWDATA" edc:mask="0xffff" edc:name="SPIWDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:mask="0xff" edc:name="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PMUCRST" edc:mask="0x1" edc:name="PMUCRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRST" edc:mask="0x1" edc:name="SPIRST" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn------n" edc:cname="PMUSPISTAT" edc:desc="" edc:impl="0xffffff81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuu------u" edc:name="PMUSPISTAT" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxx------x" edc:_addr="0x1F813E04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPIERR" edc:mask="0x1" edc:name="SPIERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SPIRDY" edc:mask="0x1" edc:name="SPIRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRADDR" edc:mask="0xff" edc:name="SPIRADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIRDATA" edc:mask="0xffff" edc:name="SPIRDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnn-nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMUCLKCTRL" edc:desc="" edc:impl="0xfdffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuu-uuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="PMUCLKCTRL" edc:nzwidth="32" edc:por="xxxxxx-xxxxxxxxxxxxxxxxxxxxxxxxx" edc:_addr="0x1F813E08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPICLKDIV" edc:mask="0x3f" edc:name="SPICLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="PMUANABUCKBOREN" edc:mask="0x1" edc:name="PMUANABUCKBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPISRC" edc:mask="0x1" edc:name="SPISRC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKCLKDIV" edc:mask="0x3f" edc:name="BUCKCLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="BUCKSRC" edc:mask="0x3" edc:name="BUCKSRC" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BACWD" edc:mask="0x1" edc:name="BACWD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEXTEN" edc:mask="0x1" edc:name="MLDOEXTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MVREFFSMEN" edc:mask="0x1" edc:name="MVREFFSMEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WCMRETEXBCWD" edc:mask="0x1" edc:name="WCMRETEXBCWD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPCYCLE" edc:mask="0xf" edc:name="CMPCYCLE" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="BKCLKHWOVR" edc:mask="0x1" edc:name="BKCLKHWOVR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MDLOEXTBOREN" edc:mask="0x1" edc:name="MDLOEXTBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCBOREN" edc:mask="0x1" edc:name="ADCBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKBOREN" edc:mask="0x1" edc:name="BUCKBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FBCLKCFG" edc:mask="0x1" edc:name="FBCLKCFG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WLDOOFF" edc:mask="0x1" edc:name="WLDOOFF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WCMRET" edc:mask="0x1" edc:name="WCMRET" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:cname="PMUMODECTRL1" edc:desc="" edc:impl="0xff1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu---uuuuu---uuuuu" edc:name="PMUMODECTRL1" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx---xxxxx---xxxxx" edc:_addr="0x1F813E0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:mask="0x1f" edc:name="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:mask="0x1f" edc:name="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:mask="0x1f" edc:name="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:mask="0x1f" edc:name="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:mask="0x1" edc:name="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:mask="0x1" edc:name="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:mask="0x1" edc:name="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:cname="PMUMODECTRL2" edc:desc="" edc:impl="0xff1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu---uuuuu---uuuuu" edc:name="PMUMODECTRL2" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx---xxxxx---xxxxx" edc:_addr="0x1F813E10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:mask="0x1f" edc:name="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:mask="0x1f" edc:name="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:mask="0x1f" edc:name="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:mask="0x1f" edc:name="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:mask="0x1" edc:name="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:mask="0x1" edc:name="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:mask="0x1" edc:name="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:cname="PMUMODECTRL3" edc:desc="" edc:impl="0xff1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu---uuuuu---uuuuu" edc:name="PMUMODECTRL3" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx---xxxxx---xxxxx" edc:_addr="0x1F813E14">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:mask="0x1f" edc:name="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:mask="0x1f" edc:name="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:mask="0x1f" edc:name="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:mask="0x1f" edc:name="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:mask="0x1" edc:name="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:mask="0x1" edc:name="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:mask="0x1" edc:name="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:cname="PMUMODECTRL4" edc:desc="" edc:impl="0xff1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu---uuuuu---uuuuu" edc:name="PMUMODECTRL4" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx---xxxxx---xxxxx" edc:_addr="0x1F813E18">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:mask="0x1f" edc:name="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:mask="0x1f" edc:name="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:mask="0x1f" edc:name="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:mask="0x1f" edc:name="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:mask="0x1" edc:name="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:mask="0x1" edc:name="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:mask="0x1" edc:name="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnn-nnnnnnn-nnnnn---nnnnn" edc:cname="PMUOVERCTRL" edc:desc="" edc:impl="0xffdfdf1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1000000001-00000uu-00000---00000" edc:name="PMUOVERCTRL" edc:nzwidth="32" edc:por="1000000001-00000xx-00000---00000" edc:_addr="0x1F813E1C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREG4OCTRL" edc:mask="0x1f" edc:name="VREG4OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3OCTRL" edc:mask="0x1f" edc:name="VREG3OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ORETEXIT" edc:mask="0x1" edc:name="ORETEXIT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OWLDOEN" edc:mask="0x1" edc:name="OWLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VREG2OCTRL" edc:mask="0x1f" edc:name="VREG2OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PHWC" edc:mask="0x1" edc:name="PHWC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVEREN" edc:mask="0x1" edc:name="OVEREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VREG1OCTRL" edc:mask="0x1f" edc:name="VREG1OCTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="OBUCKMODE" edc:mask="0x1" edc:name="OBUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OMLDOEN" edc:mask="0x1" edc:name="OMLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OBUCKEN" edc:mask="0x1" edc:name="OBUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrnnnrrrrr---rrrrr---rrrrr" edc:cname="PMUCMODE" edc:desc="" edc:impl="0xffff1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01000000uuu00000---00000---00000" edc:name="PMUCMODE" edc:nzwidth="32" edc:por="01000000xxx00000---00000---00000" edc:_addr="0x1F813E20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CVREG4OCTRL" edc:mask="0x1f" edc:name="CVREG4OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CVREG3OCTRL" edc:mask="0x1f" edc:name="CVREG3OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CVREG2OCTRL" edc:mask="0x1f" edc:name="CVREG2OCTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ADCBOR" edc:mask="0x1" edc:name="ADCBOR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKBOR" edc:mask="0x1" edc:name="BUCKBOR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEXTBOR" edc:mask="0x1" edc:name="MLDOEXTBOR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVREG1OCTRL" edc:mask="0x1f" edc:name="CVREG1OCTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="CBUCKMODE" edc:mask="0x1" edc:name="CBUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMLDOEN" edc:mask="0x1" edc:name="CMLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CBUCKEN" edc:mask="0x1" edc:name="CBUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrnnrrrrrr" edc:cname="PMUSTATUS" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000000000000uu000000" edc:name="PMUSTATUS" edc:nzwidth="32" edc:por="000000000000000000000000xx000000" edc:_addr="0x1F813E24">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STATUS" edc:mask="0x1f" edc:name="STATUS" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="WCMRM" edc:mask="0x1" edc:name="WCMRM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMUANABUCKBOR" edc:mask="0x1" edc:name="PMUANABUCKBOR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WLDORDY" edc:mask="0x1" edc:name="WLDORDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BSSEDATA" edc:mask="0xffff" edc:name="BSSEDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="BSSENUM" edc:mask="0x7f" edc:name="BSSENUM" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BSSERR" edc:mask="0x1" edc:name="BSSERR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
