Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PMUSEQ1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:name="PMUSEQ1" edc:nzwidth="32" edc:por="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:_addr="0x1F813E28">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DELAY" edc:mask="0x3f" edc:name="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:mask="0x1" edc:name="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:mask="0xff" edc:name="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:mask="0xffff" edc:name="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PMUSEQ2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:name="PMUSEQ2" edc:nzwidth="32" edc:por="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:_addr="0x1F813E2C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DELAY" edc:mask="0x3f" edc:name="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:mask="0x1" edc:name="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:mask="0xff" edc:name="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:mask="0xffff" edc:name="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PMUSEQ3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:name="PMUSEQ3" edc:nzwidth="32" edc:por="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:_addr="0x1F813E30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DELAY" edc:mask="0x3f" edc:name="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:mask="0x1" edc:name="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:mask="0xff" edc:name="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:mask="0xffff" edc:name="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMUSEQ4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="PMUSEQ4" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:_addr="0x1F813E34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DELAY" edc:mask="0x3f" edc:name="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:mask="0x1" edc:name="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:mask="0xff" edc:name="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:mask="0xffff" edc:name="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMUCFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="PMUCFG" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:_addr="0x1F813E38">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUCKSWDELAY" edc:mask="0x7f" edc:name="BUCKSWDELAY" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="MLDOSWDELAY" edc:mask="0x7f" edc:name="MLDOSWDELAY" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="MLDOEXTL" edc:mask="0x3" edc:name="MLDOEXTL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BUCKCPL" edc:mask="0xf" edc:name="BUCKCPL" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="BUCKCPH" edc:mask="0xf" edc:name="BUCKCPH" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ADCCPL" edc:mask="0xf" edc:name="ADCCPL" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ADCCPH" edc:mask="0xf" edc:name="ADCCPH" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nn-r---------nnn-----nnnnnnnnnnn" edc:cname="PMUWCMCMD" edc:desc="" edc:impl="0xd00707ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-u---------uuu-----uuuuuuuuuuu" edc:name="PMUWCMCMD" edc:nzwidth="32" edc:por="xx-x---------xxx-----xxxxxxxxxxx" edc:_addr="0x1F813E3C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WCMADDR" edc:mask="0x7ff" edc:name="WCMADDR" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WCMCLKDIV" edc:mask="0x7" edc:name="WCMCLKDIV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="WCMRDY" edc:mask="0x1" edc:name="WCMRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:mask="0x1" edc:name="MODE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
