Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNNEK" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNNEK" edc:nzwidth="32" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8203A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEK0" edc:mask="0x1" edc:name="CNNEK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK1" edc:mask="0x1" edc:name="CNNEK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK2" edc:mask="0x1" edc:name="CNNEK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK3" edc:mask="0x1" edc:name="CNNEK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK4" edc:mask="0x1" edc:name="CNNEK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK5" edc:mask="0x1" edc:name="CNNEK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK6" edc:mask="0x1" edc:name="CNNEK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK7" edc:mask="0x1" edc:name="CNNEK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK8" edc:mask="0x1" edc:name="CNNEK8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK9" edc:mask="0x1" edc:name="CNNEK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK10" edc:mask="0x1" edc:name="CNNEK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK11" edc:mask="0x1" edc:name="CNNEK11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK12" edc:mask="0x1" edc:name="CNNEK12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK13" edc:mask="0x1" edc:name="CNNEK13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK14" edc:mask="0x1" edc:name="CNNEK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNFK" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNFK" edc:nzwidth="32" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8203B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFK0" edc:mask="0x1" edc:name="CNFK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK1" edc:mask="0x1" edc:name="CNFK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK2" edc:mask="0x1" edc:name="CNFK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK3" edc:mask="0x1" edc:name="CNFK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK4" edc:mask="0x1" edc:name="CNFK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK5" edc:mask="0x1" edc:name="CNFK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK6" edc:mask="0x1" edc:name="CNFK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK7" edc:mask="0x1" edc:name="CNFK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK8" edc:mask="0x1" edc:name="CNFK8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK9" edc:mask="0x1" edc:name="CNFK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK10" edc:mask="0x1" edc:name="CNFK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK11" edc:mask="0x1" edc:name="CNFK11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK12" edc:mask="0x1" edc:name="CNFK12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK13" edc:mask="0x1" edc:name="CNFK13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK14" edc:mask="0x1" edc:name="CNFK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------nn-------------" edc:cname="SRCON0K" edc:desc="" edc:impl="0x6000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------00-------------" edc:name="SRCON0K" edc:nzwidth="32" edc:por="-----------------00-------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8203C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0K13" edc:mask="0x1" edc:name="SR0K13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0K14" edc:mask="0x1" edc:name="SR0K14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------nn-------------" edc:cname="SRCON1K" edc:desc="" edc:impl="0x6000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------00-------------" edc:name="SRCON1K" edc:nzwidth="32" edc:por="-----------------00-------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8203D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1K13" edc:mask="0x1" edc:name="SR1K13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1K14" edc:mask="0x1" edc:name="SR1K14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
