Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="------------------------nnnnnnnn" edc:cname="ADCIMCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="ADCIMCON2" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x100" edc:_addr="0x1F821050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN16" edc:mask="0x1" edc:name="SIGN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF16" edc:mask="0x1" edc:name="DIFF16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN17" edc:mask="0x1" edc:name="SIGN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF17" edc:mask="0x1" edc:name="DIFF17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN18" edc:mask="0x1" edc:name="SIGN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF18" edc:mask="0x1" edc:name="DIFF18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN19" edc:mask="0x1" edc:name="SIGN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF19" edc:mask="0x1" edc:name="DIFF19" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x100" edc:_addr="0x1F821060"/>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ADCGIRQEN1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ADCGIRQEN1" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x100" edc:_addr="0x1F821080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AGIEN0" edc:mask="0x1" edc:name="AGIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN1" edc:mask="0x1" edc:name="AGIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN2" edc:mask="0x1" edc:name="AGIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN3" edc:mask="0x1" edc:name="AGIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN4" edc:mask="0x1" edc:name="AGIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN5" edc:mask="0x1" edc:name="AGIEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN6" edc:mask="0x1" edc:name="AGIEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN7" edc:mask="0x1" edc:name="AGIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN8" edc:mask="0x1" edc:name="AGIEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN9" edc:mask="0x1" edc:name="AGIEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN10" edc:mask="0x1" edc:name="AGIEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN11" edc:mask="0x1" edc:name="AGIEN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN12" edc:mask="0x1" edc:name="AGIEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN13" edc:mask="0x1" edc:name="AGIEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN14" edc:mask="0x1" edc:name="AGIEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN15" edc:mask="0x1" edc:name="AGIEN15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x100" edc:_addr="0x1F821090"/>
      <edc:SFRDef edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCSS1" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------uuuu0000000000000000" edc:name="ADCCSS1" edc:nzwidth="32" edc:por="------------xxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x100" edc:_addr="0x1F8210A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS0" edc:mask="0x1" edc:name="CSS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS1" edc:mask="0x1" edc:name="CSS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS2" edc:mask="0x1" edc:name="CSS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS3" edc:mask="0x1" edc:name="CSS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS4" edc:mask="0x1" edc:name="CSS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS5" edc:mask="0x1" edc:name="CSS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS6" edc:mask="0x1" edc:name="CSS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS7" edc:mask="0x1" edc:name="CSS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS8" edc:mask="0x1" edc:name="CSS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS9" edc:mask="0x1" edc:name="CSS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS10" edc:mask="0x1" edc:name="CSS10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS11" edc:mask="0x1" edc:name="CSS11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS12" edc:mask="0x1" edc:name="CSS12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS13" edc:mask="0x1" edc:name="CSS13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS14" edc:mask="0x1" edc:name="CSS14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS15" edc:mask="0x1" edc:name="CSS15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS16" edc:mask="0x1" edc:name="CSS16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS17" edc:mask="0x1" edc:name="CSS17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS18" edc:mask="0x1" edc:name="CSS18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS19" edc:mask="0x1" edc:name="CSS19" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x100" edc:_addr="0x1F8210B0"/>
      <edc:SFRDef edc:access="------------nnnnrrrrrrrrrrrrrrrr" edc:cname="ADCDSTAT1" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------uuuu0000000000000000" edc:name="ADCDSTAT1" edc:nzwidth="32" edc:por="------------xxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x100" edc:_addr="0x1F8210C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ARDY0" edc:mask="0x1" edc:name="ARDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY1" edc:mask="0x1" edc:name="ARDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY2" edc:mask="0x1" edc:name="ARDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY3" edc:mask="0x1" edc:name="ARDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY4" edc:mask="0x1" edc:name="ARDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY5" edc:mask="0x1" edc:name="ARDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY6" edc:mask="0x1" edc:name="ARDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY7" edc:mask="0x1" edc:name="ARDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY8" edc:mask="0x1" edc:name="ARDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY9" edc:mask="0x1" edc:name="ARDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY10" edc:mask="0x1" edc:name="ARDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY11" edc:mask="0x1" edc:name="ARDY11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY12" edc:mask="0x1" edc:name="ARDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY13" edc:mask="0x1" edc:name="ARDY13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY14" edc:mask="0x1" edc:name="ARDY14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY15" edc:mask="0x1" edc:name="ARDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY16" edc:mask="0x1" edc:name="ARDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY17" edc:mask="0x1" edc:name="ARDY17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY18" edc:mask="0x1" edc:name="ARDY18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY19" edc:mask="0x1" edc:name="ARDY19" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x100" edc:_addr="0x1F8210D0"/>
      <edc:SFRDef edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN1" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------uuuu0000000000000000" edc:name="ADCCMPEN1" edc:nzwidth="32" edc:por="------------xxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x100" edc:_addr="0x1F8210E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:mask="0x1" edc:name="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:mask="0x1" edc:name="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:mask="0x1" edc:name="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:mask="0x1" edc:name="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:mask="0x1" edc:name="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:mask="0x1" edc:name="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:mask="0x1" edc:name="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:mask="0x1" edc:name="CMPE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE8" edc:mask="0x1" edc:name="CMPE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE9" edc:mask="0x1" edc:name="CMPE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE10" edc:mask="0x1" edc:name="CMPE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE11" edc:mask="0x1" edc:name="CMPE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE12" edc:mask="0x1" edc:name="CMPE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE13" edc:mask="0x1" edc:name="CMPE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE14" edc:mask="0x1" edc:name="CMPE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE15" edc:mask="0x1" edc:name="CMPE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE16" edc:mask="0x1" edc:name="CMPE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE17" edc:mask="0x1" edc:name="CMPE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE18" edc:mask="0x1" edc:name="CMPE18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE19" edc:mask="0x1" edc:name="CMPE19" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMP1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x100" edc:_addr="0x1F8210F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCMPLO" edc:mask="0xffff" edc:name="DCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DCMPHI" edc:mask="0xffff" edc:name="DCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN2" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------uuuu0000000000000000" edc:name="ADCCMPEN2" edc:nzwidth="32" edc:por="------------xxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS2" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="2" edc:_begin="0xe0" edc:_end="0x100" edc:_addr="0x1F821100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:mask="0x1" edc:name="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:mask="0x1" edc:name="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:mask="0x1" edc:name="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:mask="0x1" edc:name="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:mask="0x1" edc:name="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:mask="0x1" edc:name="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:mask="0x1" edc:name="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:mask="0x1" edc:name="CMPE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE8" edc:mask="0x1" edc:name="CMPE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE9" edc:mask="0x1" edc:name="CMPE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE10" edc:mask="0x1" edc:name="CMPE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE11" edc:mask="0x1" edc:name="CMPE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE12" edc:mask="0x1" edc:name="CMPE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE13" edc:mask="0x1" edc:name="CMPE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE14" edc:mask="0x1" edc:name="CMPE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE15" edc:mask="0x1" edc:name="CMPE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE16" edc:mask="0x1" edc:name="CMPE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE17" edc:mask="0x1" edc:name="CMPE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE18" edc:mask="0x1" edc:name="CMPE18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE19" edc:mask="0x1" edc:name="CMPE19" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
