Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMP2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS2" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="2" edc:_begin="0xe0" edc:_end="0x100" edc:_addr="0x1F821110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCMPLO" edc:mask="0xffff" edc:name="DCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DCMPHI" edc:mask="0xffff" edc:name="DCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x80" edc:_addr="0x1F821120"/>
      <edc:SFRDef edc:access="nnnnnnnr---nnnnnrrrrrrrrrrrrrrrr" edc:cname="ADCFLTR1" edc:desc="" edc:impl="0xff1fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000---000000000000000000000" edc:name="ADCFLTR1" edc:nzwidth="32" edc:por="00000000---000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="3" edc:_begin="0x100" edc:_end="0x110" edc:_addr="0x1F8211A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FLTRDATA" edc:mask="0xffff" edc:name="FLTRDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CHNLID" edc:mask="0x1f" edc:name="CHNLID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AFRDY" edc:mask="0x1" edc:name="AFRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFGIEN" edc:mask="0x1" edc:name="AFGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRSAM" edc:mask="0x7" edc:name="OVRSAM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DFMODE" edc:mask="0x1" edc:name="DFMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA16EN" edc:mask="0x1" edc:name="DATA16EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFEN" edc:mask="0x1" edc:name="AFEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnr---nnnnnrrrrrrrrrrrrrrrr" edc:cname="ADCFLTR2" edc:desc="" edc:impl="0xff1fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000---000000000000000000000" edc:name="ADCFLTR2" edc:nzwidth="32" edc:por="00000000---000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS2" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="4" edc:_begin="0x100" edc:_end="0x110" edc:_addr="0x1F8211B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FLTRDATA" edc:mask="0xffff" edc:name="FLTRDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CHNLID" edc:mask="0x1f" edc:name="CHNLID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AFRDY" edc:mask="0x1" edc:name="AFRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFGIEN" edc:mask="0x1" edc:name="AFGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRSAM" edc:mask="0x7" edc:name="OVRSAM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DFMODE" edc:mask="0x1" edc:name="DFMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA16EN" edc:mask="0x1" edc:name="DATA16EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFEN" edc:mask="0x1" edc:name="AFEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x40" edc:_addr="0x1F8211C0"/>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="ADCTRG1" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="ADCTRG1" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:_begin="0x200" edc:_end="0xb74" edc:_addr="0x1F821200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRGSRC0" edc:mask="0x1f" edc:name="TRGSRC0" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC1" edc:mask="0x1f" edc:name="TRGSRC1" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC2" edc:mask="0x1f" edc:name="TRGSRC2" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC3" edc:mask="0x1f" edc:name="TRGSRC3" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="ADCTRG2" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="ADCTRG2" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:_begin="0x200" edc:_end="0xb74" edc:_addr="0x1F821210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRGSRC4" edc:mask="0x1f" edc:name="TRGSRC4" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC5" edc:mask="0x1f" edc:name="TRGSRC5" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC6" edc:mask="0x1f" edc:name="TRGSRC6" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC7" edc:mask="0x1f" edc:name="TRGSRC7" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x60" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:_begin="0x200" edc:_end="0xb74" edc:_addr="0x1F821220"/>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr--rrrrrrnnrnnnnn" edc:cname="ADCCMPCON1" edc:desc="" edc:impl="0xffff3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000--00000000000000" edc:name="ADCCMPCON1" edc:nzwidth="32" edc:por="0000000000000000--00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:_begin="0x200" edc:_end="0xb74" edc:_addr="0x1F821280">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IELOLO" edc:mask="0x1" edc:name="IELOLO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IELOHI" edc:mask="0x1" edc:name="IELOHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHILO" edc:mask="0x1" edc:name="IEHILO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHIHI" edc:mask="0x1" edc:name="IEHIHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEBTWN" edc:mask="0x1" edc:name="IEBTWN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPED" edc:mask="0x1" edc:name="DCMPED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPGIEN" edc:mask="0x1" edc:name="DCMPGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDCMP" edc:mask="0x1" edc:name="ENDCMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AINID" edc:mask="0x3f" edc:name="AINID" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CVDDATA" edc:mask="0xffff" edc:name="CVDDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
