Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F82401C"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F824020"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F824024"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F824028"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F82402C"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F824030"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F824034"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F824038"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F82403C"/>
      <edc:AdjustPoint edc:offset="0x40" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824040"/>
      <edc:SFRDef edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDRX0" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDRX0" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXAN0" edc:mask="0x3f" edc:name="RXAN0" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN1" edc:mask="0x3f" edc:name="RXAN1" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN2" edc:mask="0x3f" edc:name="RXAN2" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN3" edc:mask="0x3f" edc:name="RXAN3" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDRX1" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDRX1" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXAN4" edc:mask="0x3f" edc:name="RXAN4" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN5" edc:mask="0x3f" edc:name="RXAN5" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN6" edc:mask="0x3f" edc:name="RXAN6" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN7" edc:mask="0x3f" edc:name="RXAN7" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDRX2" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDRX2" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXAN8" edc:mask="0x3f" edc:name="RXAN8" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN9" edc:mask="0x3f" edc:name="RXAN9" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN10" edc:mask="0x3f" edc:name="RXAN10" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN11" edc:mask="0x3f" edc:name="RXAN11" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDRX3" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDRX3" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F82408C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXAN12" edc:mask="0x3f" edc:name="RXAN12" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN13" edc:mask="0x3f" edc:name="RXAN13" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN14" edc:mask="0x3f" edc:name="RXAN14" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN15" edc:mask="0x3f" edc:name="RXAN15" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F824090"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F824094"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F824098"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F82409C"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240A0"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240A4"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240A8"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240AC"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240B0"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240B4"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240B8"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240BC"/>
      <edc:SFRDef edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDTX0" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDTX0" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F8240C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXAN0" edc:mask="0x3f" edc:name="TXAN0" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN1" edc:mask="0x3f" edc:name="TXAN1" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN2" edc:mask="0x3f" edc:name="TXAN2" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN3" edc:mask="0x3f" edc:name="TXAN3" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDTX1" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDTX1" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F8240C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXAN4" edc:mask="0x3f" edc:name="TXAN4" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN5" edc:mask="0x3f" edc:name="TXAN5" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN6" edc:mask="0x3f" edc:name="TXAN6" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN7" edc:mask="0x3f" edc:name="TXAN7" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
