Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDTX2" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDTX2" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F8240C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXAN8" edc:mask="0x3f" edc:name="TXAN8" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN9" edc:mask="0x3f" edc:name="TXAN9" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN10" edc:mask="0x3f" edc:name="TXAN10" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN11" edc:mask="0x3f" edc:name="TXAN11" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDTX3" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDTX3" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F8240CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXAN12" edc:mask="0x3f" edc:name="TXAN12" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN13" edc:mask="0x3f" edc:name="TXAN13" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN14" edc:mask="0x3f" edc:name="TXAN14" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXAN15" edc:mask="0x3f" edc:name="TXAN15" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240D0"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240D4"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240D8"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240DC"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240E0"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240E4"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240E8"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240EC"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240F0"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240F4"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240F8"/>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8240FC"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDSD0C1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDSD0C1" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD0OVRSAMP" edc:mask="0xff" edc:name="SD0OVRSAMP" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SD0THRESH" edc:mask="0xffffff" edc:name="SD0THRESH" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDSD0C2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDSD0C2" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD0RXBEG" edc:mask="0x3f" edc:name="SD0RXBEG" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD0RXSTRIDE1" edc:mask="0x3" edc:name="SD0RXSTRIDE1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD0RXEND" edc:mask="0x3f" edc:name="SD0RXEND" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD0RXSTRIDE2" edc:mask="0x3" edc:name="SD0RXSTRIDE2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD0TXBEG" edc:mask="0x3f" edc:name="SD0TXBEG" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD0TXSTRIDE1" edc:mask="0x3" edc:name="SD0TXSTRIDE1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD0TXEND" edc:mask="0x3f" edc:name="SD0TXEND" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD0TXSTRIDE2" edc:mask="0x3" edc:name="SD0TXSTRIDE2" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nn--nnnn----nnnn-nnnnnnn-nnnnnnn" edc:cname="CVDSD0C3" edc:desc="" edc:impl="0xcf0f7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu--uuuu----uuuu-uuuuuuu-uuuuuuu" edc:name="CVDSD0C3" edc:nzwidth="32" edc:por="xx--xxxx----xxxx-xxxxxxx-xxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824108">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD0CHGTIME" edc:mask="0x7f" edc:name="SD0CHGTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD0ACQTIME" edc:mask="0x7f" edc:name="SD0ACQTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDCPL" edc:mask="0x7" edc:name="CVDCPL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:mask="0x1" edc:name="CVDEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="SD0MUT" edc:mask="0x1" edc:name="SD0MUT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD0SELF" edc:mask="0x1" edc:name="SD0SELF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD0IEN" edc:mask="0x1" edc:name="SD0IEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD0BUF" edc:mask="0x1" edc:name="SD0BUF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SD0EN" edc:mask="0x3" edc:name="SD0EN" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="CVDSD0T2" edc:desc="" edc:impl="0x7f7f7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu-uuuuuuu-uuuuuuu-uuuuuuu" edc:name="CVDSD0T2" edc:nzwidth="32" edc:por="-xxxxxxx-xxxxxxx-xxxxxxx-xxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F82410C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD0CONTIME" edc:mask="0x7f" edc:name="SD0CONTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD0POLTIME" edc:mask="0x7f" edc:name="SD0POLTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SD0OVRTIME" edc:mask="0x7f" edc:name="SD0OVRTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD0CHNTIME" edc:mask="0x7f" edc:name="SD0CHNTIME" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDSD1C1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDSD1C1" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD1OVRSAMP" edc:mask="0xff" edc:name="SD1OVRSAMP" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SD1THRESH" edc:mask="0xffffff" edc:name="SD1THRESH" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDSD1C2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDSD1C2" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD1RXBEG" edc:mask="0x3f" edc:name="SD1RXBEG" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD1RXSTRIDE1" edc:mask="0x3" edc:name="SD1RXSTRIDE1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD1RXEND" edc:mask="0x3f" edc:name="SD1RXEND" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD1RXSTRIDE2" edc:mask="0x3" edc:name="SD1RXSTRIDE2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD1TXBEG" edc:mask="0x3f" edc:name="SD1TXBEG" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD1TXSTRIDE1" edc:mask="0x3" edc:name="SD1TXSTRIDE1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD1TXEND" edc:mask="0x3f" edc:name="SD1TXEND" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD1TXSTRIDE2" edc:mask="0x3" edc:name="SD1TXSTRIDE2" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nn--nnnn----nnnn-nnnnnnn-nnnnnnn" edc:cname="CVDSD1C3" edc:desc="" edc:impl="0xcf0f7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu--uuuu----uuuu-uuuuuuu-uuuuuuu" edc:name="CVDSD1C3" edc:nzwidth="32" edc:por="xx--xxxx----xxxx-xxxxxxx-xxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD1CHGTIME" edc:mask="0x7f" edc:name="SD1CHGTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD1ACQTIME" edc:mask="0x7f" edc:name="SD1ACQTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDCPL" edc:mask="0x7" edc:name="CVDCPL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:mask="0x1" edc:name="CVDEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="SD1MUT" edc:mask="0x1" edc:name="SD1MUT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD1SELF" edc:mask="0x1" edc:name="SD1SELF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD1IEN" edc:mask="0x1" edc:name="SD1IEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD1BUF" edc:mask="0x1" edc:name="SD1BUF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SD1EN" edc:mask="0x3" edc:name="SD1EN" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="CVDSD1T2" edc:desc="" edc:impl="0x7f7f7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu-uuuuuuu-uuuuuuu-uuuuuuu" edc:name="CVDSD1T2" edc:nzwidth="32" edc:por="-xxxxxxx-xxxxxxx-xxxxxxx-xxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F82411C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD1CONTIME" edc:mask="0x7f" edc:name="SD1CONTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD1POLTIME" edc:mask="0x7f" edc:name="SD1POLTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SD1OVRTIME" edc:mask="0x7f" edc:name="SD1OVRTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD1CHNTIME" edc:mask="0x7f" edc:name="SD1CHNTIME" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
