Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDSD2C1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDSD2C1" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD2OVRSAMP" edc:mask="0xff" edc:name="SD2OVRSAMP" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SD2THRESH" edc:mask="0xffffff" edc:name="SD2THRESH" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDSD2C2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDSD2C2" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD2RXBEG" edc:mask="0x3f" edc:name="SD2RXBEG" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD2RXSTRIDE1" edc:mask="0x3" edc:name="SD2RXSTRIDE1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD2RXEND" edc:mask="0x3f" edc:name="SD2RXEND" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD2RXSTRIDE2" edc:mask="0x3" edc:name="SD2RXSTRIDE2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD2TXBEG" edc:mask="0x3f" edc:name="SD2TXBEG" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD2TXSTRIDE1" edc:mask="0x3" edc:name="SD2TXSTRIDE1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD2TXEND" edc:mask="0x3f" edc:name="SD2TXEND" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD2TXSTRIDE2" edc:mask="0x3" edc:name="SD2TXSTRIDE2" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nn--nnnn----nnnn-nnnnnnn-nnnnnnn" edc:cname="CVDSD2C3" edc:desc="" edc:impl="0xcf0f7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu--uuuu----uuuu-uuuuuuu-uuuuuuu" edc:name="CVDSD2C3" edc:nzwidth="32" edc:por="xx--xxxx----xxxx-xxxxxxx-xxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824128">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD2CHGTIME" edc:mask="0x7f" edc:name="SD2CHGTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2ACQTIME" edc:mask="0x7f" edc:name="SD2ACQTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDCPL" edc:mask="0x7" edc:name="CVDCPL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:mask="0x1" edc:name="CVDEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SD2MUT" edc:mask="0x1" edc:name="SD2MUT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2SELF" edc:mask="0x1" edc:name="SD2SELF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2IEN" edc:mask="0x1" edc:name="SD2IEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2BUF" edc:mask="0x1" edc:name="SD2BUF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SD2EN" edc:mask="0x3" edc:name="SD2EN" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="CVDSD2T2" edc:desc="" edc:impl="0x7f7f7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu-uuuuuuu-uuuuuuu-uuuuuuu" edc:name="CVDSD2T2" edc:nzwidth="32" edc:por="-xxxxxxx-xxxxxxx-xxxxxxx-xxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F82412C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD2CONTIME" edc:mask="0x7f" edc:name="SD2CONTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2POLTIME" edc:mask="0x7f" edc:name="SD2POLTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SD2OVRTIME" edc:mask="0x7f" edc:name="SD2OVRTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2CHNTIME" edc:mask="0x7f" edc:name="SD2CHNTIME" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDSD3C1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDSD3C1" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824130">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD3OVRSAMP" edc:mask="0xff" edc:name="SD3OVRSAMP" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SD3THRESH" edc:mask="0xffffff" edc:name="SD3THRESH" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDSD3C2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDSD3C2" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x204" edc:_addr="0x1F824134">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD3RXBEG" edc:mask="0x3f" edc:name="SD3RXBEG" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD3RXSTRIDE1" edc:mask="0x3" edc:name="SD3RXSTRIDE1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD3RXEND" edc:mask="0x3f" edc:name="SD3RXEND" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD3RXSTRIDE2" edc:mask="0x3" edc:name="SD3RXSTRIDE2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD3TXBEG" edc:mask="0x3f" edc:name="SD3TXBEG" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD3TXSTRIDE1" edc:mask="0x3" edc:name="SD3TXSTRIDE1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD3TXEND" edc:mask="0x3f" edc:name="SD3TXEND" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD3TXSTRIDE2" edc:mask="0x3" edc:name="SD3TXSTRIDE2" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
