Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="-----------------nnn--nnnnnnnnnn" edc:cname="EMAC1CFG2" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxx100xx0010110100" edc:name="EMAC1CFG2" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxx100xx0010110100" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x330" edc:_addr="0x1F843210">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxCFG2"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FULLDPLX" edc:desc="" edc:mask="0x1" edc:name="FULLDPLX" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LENGTHCK" edc:desc="" edc:mask="0x1" edc:name="LENGTHCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HUGEFRM" edc:desc="" edc:mask="0x1" edc:name="HUGEFRM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DELAYCRC" edc:desc="" edc:mask="0x1" edc:name="DELAYCRC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCENABLE" edc:desc="" edc:mask="0x1" edc:name="CRCENABLE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PADENABLE" edc:desc="" edc:mask="0x1" edc:name="PADENABLE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANPAD" edc:desc="" edc:mask="0x1" edc:name="VLANPAD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOPAD" edc:desc="" edc:mask="0x1" edc:name="AUTOPAD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUREPRE" edc:desc="" edc:mask="0x1" edc:name="PUREPRE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LONGPRE" edc:desc="" edc:mask="0x1" edc:name="LONGPRE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="NOBKOFF" edc:desc="" edc:mask="0x1" edc:name="NOBKOFF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPNOBKOFF" edc:desc="" edc:mask="0x1" edc:name="BPNOBKOFF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXCESSDFR" edc:desc="" edc:mask="0x1" edc:name="EXCESSDFR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------------nnnnnnn" edc:cname="EMAC1IPGT" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxx0010010" edc:name="EMAC1IPGT" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxx0010010" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x330" edc:_addr="0x1F843220">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxIPGT"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="B2BIPKTGP" edc:desc="" edc:mask="0x7f" edc:name="B2BIPKTGP" edc:nzwidth="0x7"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------nnnnnnn-nnnnnnn" edc:cname="EMAC1IPGR" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxx0001100x0010010" edc:name="EMAC1IPGR" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxx0001100x0010010" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x330" edc:_addr="0x1F843230">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxIPGR"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NB2BIPKTGP2" edc:desc="" edc:mask="0x7f" edc:name="NB2BIPKTGP2" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="NB2BIPKTGP1" edc:desc="" edc:mask="0x7f" edc:name="NB2BIPKTGP1" edc:nzwidth="0x7"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nnnnnn----nnnn" edc:cname="EMAC1CLRT" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxx110111xxxx1111" edc:name="EMAC1CLRT" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxx110111xxxx1111" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x330" edc:_addr="0x1F843240">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxCLRT"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RETX" edc:desc="" edc:mask="0xf" edc:name="RETX" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CWINDOW" edc:desc="" edc:mask="0x1" edc:name="CWINDOW" edc:nzwidth="0x6"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EMAC1MAXF" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000010111101110" edc:name="EMAC1MAXF" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000010111101110" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x330" edc:_addr="0x1F843250">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMAXF"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MACMAXF" edc:desc="" edc:mask="0x1" edc:name="MACMAXF" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
