Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR28" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR28" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:_addr="0x1F87107C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR29" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR29" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:_addr="0x1F871080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR30" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR30" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:_addr="0x1F871084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR31" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR31" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:_addr="0x1F871088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR32" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR32" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:_addr="0x1F87108C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xff70" edc:_addr="0x1F871090"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1F8C0000" edc:endaddr="0x1F8E6000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_indep_a">
      <edc:AdjustPoint edc:offset="0x21000" edc:_addr="0x1F8C0000"/>
      <edc:SFRDef edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1XCON1" edc:desc="SQI XIP Control Register 1" edc:impl="0x3fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u00000001011000000110000000000" edc:name="SQI1XCON1" edc:nzwidth="32" edc:por="--x00000001011000000110000000000" ltx:baseofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TYPECMD" edc:desc="The boot controller will send the command in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPECMD" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEADDR" edc:desc="The boot controller will send the address in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEADDR" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEMODE" edc:desc="The boot controller will send the mode in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEMODE" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEDUMMY" edc:desc="The boot controller will send the dummy in Single Lange, Dual Lane, or Quad Lane" edc:mask="0x3" edc:name="TYPEDUMMY" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lange mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEDATA" edc:desc="The boot controller will receive the data in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEDATA" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="READOPCODE" edc:desc="These bits contain the 8-bit op code value for read operation." edc:mask="0xff" edc:name="READOPCODE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="ADDRBYTES" edc:desc="" edc:mask="0x7" edc:name="ADDRBYTES" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Four address bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Three address bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Two address bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="One address bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Zero address bytes" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DUMMYBYTES" edc:desc="Transmit Dummy Bytes bits" edc:mask="0x7" edc:name="DUMMYBYTES" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Transmit seven dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Transmit six dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Transmit five dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Transmit four dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Transmit three dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Transmit two dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Transmit one dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Transmit zero dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRCMD" edc:desc="SQI DDR Command Mode bit" edc:mask="0x1" edc:name="DDRCMD" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI command bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI command bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRADDR" edc:desc="SQI Address Mode bit" edc:mask="0x1" edc:name="DDRADDR" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI address bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI address bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRMODE" edc:desc="SQI DDR Mode bit" edc:mask="0x1" edc:name="DDRMODE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI mode bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI mode bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRDUMMY" edc:desc="SQI Dummy DDR Mode bit" edc:mask="0x1" edc:name="DDRDUMMY" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI dummy bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI dummy bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRDATA" edc:desc="SQI Data DDR Mode bit" edc:mask="0x1" edc:name="DDRDATA" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI data bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI data bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDRCMD" edc:desc="SQI Command in SDR Mode bit" edc:mask="0x1" edc:name="SDRCMD" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI command is in SDR mode and SQI data is in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI command is in DDR mode and SQI data is in DDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------nnnnnnnnnnnn" edc:cname="SQI1XCON2" edc:desc="SQI XIP Control Register 2" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000010100000" edc:name="SQI1XCON2" edc:nzwidth="32" edc:por="--------------------000010100000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1004">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MODECODE" edc:desc="These bits contain the 8-bit code value for the mode bits." edc:mask="0xff" edc:name="MODECODE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="MODEBYTES" edc:desc="Mode Byte Cycle Enable bits" edc:mask="0x3" edc:name="MODEBYTES" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Three cycles" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Two cycles" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="One cycle" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Zero cycles" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:desc="Device Select bits" edc:mask="0x3" edc:name="DEVSEL" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Device 1 is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Device 0 is selected" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------nnn-nnnnnnn--n-nn---nnnnnn" edc:cname="SQI1CFG" edc:desc="SQI Configuration Register" edc:impl="0x3bf977f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------000-0000001--0-00---000000" edc:name="SQI1CFG" edc:nzwidth="32" edc:por="------000-0000001--0-00---000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1008">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Mode Select bits" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="XIP mode is selected (when this mode is entered, the module behaves as if executing in place (XIP),but uses the register data to control timing)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="DMA mode is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="CPU mode is selected (the module is controlled by the CPU in PIO mode. This mode is entered whenleaving Boot or XIP mode)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPHA" edc:desc="Clock Phase Select bit" edc:mask="0x1" edc:name="CPHA" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="SQICLK starts toggling at the start of the first data bit" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQICLK starts toggling at the middle of the first data bit" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity Select bit" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Active-low SQICLK (SQICLK high is the Idle state)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Active-high SQICLK (SQICLK low is the Idle state)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LSBF" edc:desc="Data Format Select bit" edc:mask="0x1" edc:name="LSBF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="LSB is send or received first" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="MSB is sent or received first" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="WP" edc:desc="In Single Lane or Dual Lane mode, this bit is used to drive the SQID2 pin, which can be used with deviceswith a write-protect pin. The meaning of the values for this bit will depend on the device to which SQID2 isconnected." edc:mask="0x1" edc:name="WP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HOLD" edc:desc="Hold bit. In Single Lane or Dual Lane mode, this bit is used to drive the SQID3 pin, which can be used for devices with a HOLD input pin. The meaning of the values for this bit will depend on the device to which SQID3 is connected." edc:mask="0x1" edc:name="HOLD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="BURSTEN" edc:desc="Burst Configuration bit" edc:mask="0x1" edc:name="BURSTEN" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Burst is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Burst is not enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RESET" edc:desc="Software Reset Select bit" edc:mask="0x1" edc:name="RESET" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXBUFRST" edc:desc="Transmit Buffer Reset bit" edc:mask="0x1" edc:name="TXBUFRST" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated clearing the transmit buffer" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXBUFRST" edc:desc="Receive Buffer Reset bit" edc:mask="0x1" edc:name="RXBUFRST" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated clearing the receive buffer" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONBUFRST" edc:desc="Control Buffer Reset bit" edc:mask="0x1" edc:name="CONBUFRST" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated, clearing the control buffer" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATAEN" edc:desc="Data Output Enable bits" edc:mask="0x3" edc:name="DATAEN" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="SQID3-SQID0 outputs are enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="SQID1 and SQID0 data outputs are enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQID0 data output is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SQIEN" edc:desc="SQI Enable bit" edc:mask="0x1" edc:name="SQIEN" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI module is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI module is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSEN" edc:desc="Chip Select Output Enable bits" edc:mask="0x3" edc:name="CSEN" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Chip Select 0 and Chip Select 1 are used" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select 1 is used (Chip Select 0 is not used)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select 0 is used (Chip Select 1 is not used)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select 0 and Chip Select 1 are not used" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
