Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1CON" edc:desc="SQI Control Register" edc:impl="0x1ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0000000000000000000000000" edc:name="SQI1CON" edc:nzwidth="32" edc:por="-------0000000000000000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E100C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXRXCOUNT" edc:desc="" edc:mask="0xffff" edc:name="TXRXCOUNT" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="CMDINIT" edc:desc="" edc:mask="0x3" edc:name="CMDINIT" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="LANEMODE" edc:desc="" edc:mask="0x3" edc:name="LANEMODE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:desc="SQI Device Select bits" edc:mask="0x3" edc:name="DEVSEL" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Select Device 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Select Device 0" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DASSERT" edc:desc="Chip Select Assert bit" edc:mask="0x1" edc:name="DASSERT" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Chip Select is deasserted after transmission or reception of the specified number of bytes" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select is not deasserted after transmission or reception of the specified number of bytes" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRMODE" edc:desc="Double Data Rate Mode bit" edc:mask="0x1" edc:name="DDRMODE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Set the SQI transfers to DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Set the SQI transfers to SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCHECK" edc:desc="Flash Status Check bit" edc:mask="0x1" edc:name="SCHECK" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Check the status of the Flash" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Do not check the status of the Flash" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------nnnnnnnnnnn------rn" edc:cname="SQI1CLKCON" edc:desc="SQI Clock Control Register" edc:impl="0x7ff03" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------00000000000------00" edc:name="SQI1CLKCON" edc:nzwidth="32" edc:por="-------------00000000000------00" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1010">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EN" edc:desc="Tsqi Clock Enable Select bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Enable the SQI clock (Tsqi)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Disable the SQI clock (Tsqi)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STABLE" edc:desc="Tsqi Clock Stable Select bit" edc:mask="0x1" edc:name="STABLE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Tsqi clock is stable" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Tsqi clock is not stable" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CLKDIV" edc:desc="SQI Clock Tsqi Frequency Select bits" edc:mask="0x7ff" edc:name="CLKDIV" edc:nzwidth="11">
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 2048" edc:when="(field &amp; 0x3ff) == 0x200"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 1024" edc:when="(field &amp; 0x3ff) == 0x100"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 512" edc:when="(field &amp; 0x3ff) == 0x80"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 256" edc:when="(field &amp; 0x3ff) == 0x40"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 128" edc:when="(field &amp; 0x3ff) == 0x20"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 64" edc:when="(field &amp; 0x3ff) == 0x10"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 32" edc:when="(field &amp; 0x3ff) == 0x8"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 16" edc:when="(field &amp; 0x3ff) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Base Clock Tbc is divided by 8" edc:when="(field &amp; 0x3ff) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Base clock Tbc is divided by 4" edc:when="(field &amp; 0x3ff) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Base clock Tbc is divided by 2" edc:when="(field &amp; 0x3ff) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nnnnnn--nnnnnn" edc:cname="SQI1CMDTHR" edc:desc="SQI Command Threshold Register" edc:impl="0x1ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------000000--000000" edc:name="SQI1CMDTHR" edc:nzwidth="32" edc:por="------------------000000--000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1014">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXCMDTHR" edc:desc="Receive Command Threshold bits. In receive initiation mode, the SQI module attempts to perform receive operations to fetch these number of bytes in the receive buffer. If software performs any reads, hardware would initiate a receive transfer to make the receive buffer count equal to the value in these bits. For 16-bit mode, the value should be a multiple of 2." edc:mask="0x3f" edc:name="RXCMDTHR" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="TXCMDTHR" edc:desc="Transmit Command Threshold bits. Number of bytes in TX buffer at which to perform transmit operation. Should usually be '1' for normal Flash commands, and set to a higher value for page programming. For 16-bit mode, the value should be a multiple of 2." edc:mask="0x3f" edc:name="TXCMDTHR" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nnnnnn--nnnnnn" edc:cname="SQI1INTTHR" edc:desc="SQI Interrupt Threshold Register" edc:impl="0x1ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------000000--000000" edc:name="SQI1INTTHR" edc:nzwidth="32" edc:por="------------------000000--000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1018">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINTTHR" edc:desc="Receive Interrupt Threshold bits. A receive interrupt is set when the buffer count is larger than or equal to this value. RXINTTHR is the number of bytes in the receive buffer. For 16-bit mode, the value should be a multiple of 2." edc:mask="0x3f" edc:name="RXINTTHR" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="TXINTTHR" edc:desc="Transmit Interrupt Threshold bits. A transmit interrupt is set when the transmit buffer has more space than these number of bytes. For 16-bit mode, the value should be a multiple of 2." edc:mask="0x3f" edc:name="TXINTTHR" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------nnnnnnnnnnnn" edc:cname="SQI1INTEN" edc:desc="SQI Interrupt Enable Register" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="SQI1INTEN" edc:nzwidth="32" edc:por="--------------------000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E101C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXEMPTYIE" edc:desc="Transmit Buffer Empty Interrupt Enable bit" edc:mask="0x1" edc:name="TXEMPTYIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXFULLIE" edc:desc="Transmit Buffer Full Interrupt Enable bit" edc:mask="0x1" edc:name="TXFULLIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXTHRIE" edc:desc="Transmit Buffer Threshold Interrupt Enable bit" edc:mask="0x1" edc:name="TXTHRIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXEMPTYIE" edc:desc="Receive Buffer Empty Interrupt Enabled bit" edc:mask="0x1" edc:name="RXEMPTYIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXFULLIE" edc:desc="Receive Buffer Full Interrupt Enable bit" edc:mask="0x1" edc:name="RXFULLIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXTHRIE" edc:desc="Receive Buffer Threshold Interrupt Enable bit" edc:mask="0x1" edc:name="RXTHRIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONFULLIE" edc:desc="Control Buffer Full Interrupt Enable bit" edc:mask="0x1" edc:name="CONFULLIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONEMPTYIE" edc:desc="Control Buffer Empty Interrupt Enabled bit" edc:mask="0x1" edc:name="CONEMPTYIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONTHRIE" edc:desc="Control Buffer Threshold Interrupt Enable bit" edc:mask="0x1" edc:name="CONTHRIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BDDONEIE" edc:desc="DMA Buffer Descriptor Done Interrupt Enable bit" edc:mask="0x1" edc:name="BDDONEIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PKTCOMPIE" edc:desc="DMA Buffer Descriptor Packet Complete Interrupt Enable bit" edc:mask="0x1" edc:name="PKTCOMPIE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMAEIE" edc:desc="DMA Bus Error Interrupt Enable bit" edc:mask="0x1" edc:name="DMAEIE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------nnnnnnnnnnnn" edc:cname="SQI1INTSTAT" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000010101101" edc:name="SQI1INTSTAT" edc:nzwidth="32" edc:por="--------------------000010101101" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1020">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXEMPTYIF" edc:desc="Transmit Buffer Empty Interrupt Status bit" edc:mask="0x1" edc:name="TXEMPTYIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="The transmit buffer is empty" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="The transmit buffer has content" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXFULLIF" edc:desc="Transmit Buffer Full Interrupt Status bit" edc:mask="0x1" edc:name="TXFULLIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="The transmit buffer is full" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="The transmit buffer is not full" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXTHRIF" edc:desc="Transmit Buffer Threshold Interrupt Status bit" edc:mask="0x1" edc:name="TXTHRIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Transmit buffer has more than TXINTTHR words of space available" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Transmit buffer has less than TXINTTHR words of space available" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXEMPTYIF" edc:desc="Receive Buffer Empty Interrupt Status bit" edc:mask="0x1" edc:name="RXEMPTYIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Receive buffer is empty" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Receive buffer is not empty" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXFULLIF" edc:desc="Receive Buffer Full Interrupt Status bit" edc:mask="0x1" edc:name="RXFULLIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Receive buffer is full" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Receive buffer is not full" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXTHRIF" edc:desc="Receive Buffer Threshold Interrupt Status bit" edc:mask="0x1" edc:name="RXTHRIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Receive buffer has RXINTTHR or more words of space available" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Receive buffer has less than RXINTTHR words of space available" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONFULLIF" edc:desc="Control Buffer Full Interrupt Status bit" edc:mask="0x1" edc:name="CONFULLIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Control buffer is full" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Control buffer is not full" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONEMPTYIF" edc:desc="Control Buffer Empty Interrupt Status bit" edc:mask="0x1" edc:name="CONEMPTYIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Control buffer is empty" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Control buffer is not empty" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONTHRIF" edc:desc="Control Buffer Threshold Interrupt Status bit" edc:mask="0x1" edc:name="CONTHRIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="The control buffer has THRES or more words of space available" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="The control buffer has less than THRES words of space available" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BDDONEIF" edc:desc="DMA Buffer Descriptor Done Interrupt Status bit" edc:mask="0x1" edc:name="BDDONEIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="DMA BD process is done" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="DMA BD process is in progress" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PKTCOMPIF" edc:desc="DMA Buffer Descriptor Processor Packet Complete Interrupt Status bit" edc:mask="0x1" edc:name="PKTCOMPIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="DMA BD packet is complete" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="DMA BD packet is in progress" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMAEIF" edc:desc="DMA Bus Error Interrupt Flag bit" edc:mask="0x1" edc:name="DMAEIF" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="DMA bus error has occurred" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="DMA bus error has not occurred" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1TXDATA" edc:desc="SQI Transmit Data Buffer Register" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SQI1TXDATA" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1024">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXDATA" edc:desc="Transmit Command Data bits. Data is loaded into this register before being transmitted." edc:mask="0xffffffff" edc:name="TXDATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
