Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="SQI1RXDATA" edc:desc="SQI Receive Data Buffer Register" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SQI1RXDATA" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1028">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXDATA" edc:desc="Receive Data Buffer bits. At the end of a data transfer, the data in the shift register is loaded into the RXDATA register. This register works like a buffer." edc:mask="0xffffffff" edc:name="RXDATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------rrrrrr----------rrrrrr" edc:cname="SQI1STAT1" edc:desc="SQI Status Register 1" edc:impl="0x3f003f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000----------000000" edc:name="SQI1STAT1" edc:nzwidth="32" edc:por="----------000000----------000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E102C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXBUFCNT" edc:desc="Number of words of read data in the buffer." edc:mask="0x3f" edc:name="RXBUFCNT" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="TXBUFFREE" edc:desc="Transmit Buffer Available Word Space bits" edc:mask="0x3f" edc:name="TXBUFFREE" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------rr-----rrrrrrrr-rr" edc:cname="SQI1STAT2" edc:desc="SQI Status Register 2" edc:impl="0x307fb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00-----00000000-00" edc:name="SQI1STAT2" edc:nzwidth="32" edc:por="--------------00-----00000000-00" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1030">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXOV" edc:desc="Transmit Buffer Overflow Status bit" edc:mask="0x1" edc:name="TXOV" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Transmit Buffer overflow has occurred" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Transmit Buffer overflow has not occurred" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXUN" edc:desc="Receive Buffer Underflow Status bit" edc:mask="0x1" edc:name="RXUN" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Receive Buffer Underflow has occurred" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Receive Buffer Underflow has not occurred" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SQID0" edc:desc="SQID0 Status bit" edc:mask="0x1" edc:name="SQID0" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Data is present on SQID0" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Data is not present on SQID0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SQID1" edc:desc="SQID1 Status bit" edc:mask="0x1" edc:name="SQID1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Data is present on SQID1" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Data is not present on SQID1" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SQID2" edc:desc="SQID2 Status bit" edc:mask="0x1" edc:name="SQID2" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Data is present on SQID2" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Data is not present on SQID2" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SQID3" edc:desc="SQID3 Status bit" edc:mask="0x1" edc:name="SQID3" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Data is present on SQID3" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Data is not present on SQID3" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONAVAIL" edc:desc="Control IFO Space Available bits" edc:mask="0xf" edc:name="CONAVAIL" edc:nzwidth="4">
              <edc:SFRFieldSemantic edc:desc="32 bytes are available" edc:when="(field &amp; 0x1f) == 0x1f"/>
              <edc:SFRFieldSemantic edc:desc="31 bytes are available" edc:when="(field &amp; 0x1f) == 0x1e"/>
              <edc:SFRFieldSemantic edc:desc="1 byte is available" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="No bytes are available" edc:when="(field &amp; 0x1f) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="CMDSTAT" edc:desc="Current Command Status bits" edc:mask="0x3" edc:name="CMDSTAT" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Receive" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Transmit" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Idle" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------------------nnn" edc:cname="SQI1BDCON" edc:desc="SQI Buffer Descriptor Control Register" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------------000" edc:name="SQI1BDCON" edc:nzwidth="32" edc:por="-----------------------------000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1034">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="DMA Enable bit" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="DMA is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="DMA is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POLLEN" edc:desc="Buffer Descriptor Poll Enable bit" edc:mask="0x1" edc:name="POLLEN" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="BDP poll enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="BDP poll is not enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Buffer Descriptor Processor Start bit" edc:mask="0x1" edc:name="START" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Start the buffer descriptor processor" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Disable the buffer descriptor processor" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="SQI1BDCURADD" edc:desc="SQI Buffer Descriptor Current Address Register" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SQI1BDCURADD" edc:nzwidth="32" edc:por="00000001000000000000000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1038">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDCURRADDR" edc:desc="The address in physical memory of the current descriptor being processed by the Buffer Descriptor Processor." edc:mask="0xffffffff" edc:name="BDCURRADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8E103C"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1BDBASEADD" edc:desc="SQI Buffer Descriptor Base Address Register" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SQI1BDBASEADD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1040">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDADDR" edc:desc="The address in physical memory of the first buffer descriptor. This register should be updated only when the DMA is idle." edc:mask="0xffffffff" edc:name="BDADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
