Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="----------rrrrrrrrrrrrrrrrrrrrrr" edc:cname="SQI1BDSTAT" edc:desc="SQI Buffer Descriptor Status Register" edc:impl="0x3fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------xxxxxxxxxxxxxxxxxxxxxx" edc:name="SQI1BDSTAT" edc:nzwidth="32" edc:por="----------xxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1044">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDCON" edc:desc="DMA Buffer Descriptor Control Word bits. These bits contain the current buffer descriptor control word." edc:mask="0xffff" edc:name="BDCON" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="DMAACTV" edc:desc="DMA Buffer Descriptor Processor Active Status bit" edc:mask="0x1" edc:name="DMAACTV" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Buffer Descriptor Processor is active" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Buffer Descriptor Processor is idle" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMASTART" edc:desc="DMA Buffer Descriptor Processor Start Status bit" edc:mask="0x1" edc:name="DMASTART" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="DMA has started" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="DMA has not started" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BDSTATE" edc:desc="DMA Buffer Descriptor Processor State Status bits" edc:mask="0xf" edc:name="BDSTATE" edc:nzwidth="4">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x8) == 0x8"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Fetched buffer descriptor is disabled" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Descriptor is done" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Data phase" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Buffer descriptor is loading" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Descriptor fetch request is pending" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Idle" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SQI1BDPOLLCON" edc:desc="SQI Buffer Descriptor Poll Control Register" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SQI1BDPOLLCON" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1048">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POLLCON" edc:desc="Buffer Descriptor Processor Poll Status bits. These bits indicate the number of cycles the BDP would wait before refetching the descriptor control word if the previous descriptor fetched was disabled." edc:mask="0xffff" edc:name="POLLCON" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---rrrr----rrrrr-------rrrrrrrrr" edc:cname="SQI1BDTXDSTAT" edc:desc="SQI Buffer Descriptor DMA Transmit Status Register" edc:impl="0x1e1f01ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---xxxx----xxxxx-------xxxxxxxxx" edc:name="SQI1BDTXDSTAT" edc:nzwidth="32" edc:por="---xxxx----xxxxx-------xxxxxxxxx" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E104C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXCURBUFLEN" edc:desc="Current DMA Transmit Buffer Length Status bits." edc:mask="0x1ff" edc:name="TXCURBUFLEN" edc:nzwidth="9"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="TXBUFCNT" edc:desc="DMA Buffer Byte Count Status bits" edc:mask="0x1f" edc:name="TXBUFCNT" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TXSTATE" edc:desc="Current DMA Transmit State Status bits" edc:mask="0xf" edc:name="TXSTATE" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---rrrr----rrrrr-------rrrrrrrrr" edc:cname="SQI1BDRXDSTAT" edc:desc="SQI Buffer Descriptor DMA Receive Status Register" edc:impl="0x1e1f01ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---xxxx----xxxxx-------xxxxxxxxx" edc:name="SQI1BDRXDSTAT" edc:nzwidth="32" edc:por="---xxxx----xxxxx-------xxxxxxxxx" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1050">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXCURBUFLEN" edc:desc="Current DMA Receive Buffer Length Status bits." edc:mask="0x1ff" edc:name="RXCURBUFLEN" edc:nzwidth="9"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="RXBUFCNT" edc:desc="DMA Buffer Byte Count Status bits." edc:mask="0x1f" edc:name="RXBUFCNT" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RXSTATE" edc:desc="Current DMA Receive State Status bits." edc:mask="0xf" edc:name="RXSTATE" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SQI1THR" edc:desc="SQI Threshold Control Register" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SQI1THR" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1054">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="THRES" edc:desc="SQI Control Threshold Value bits. The SQI control threshold interrupt is asserted when the amount of space indicated by THRES&lt;6:0&gt; is available in the SQI control buffer." edc:mask="0xf" edc:name="THRES" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
