Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="--------------------nnnnnnnnnnnn" edc:cname="SQI1INTSIGEN" edc:desc="SQI Interrupt Signal Enable Register" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="SQI1INTSIGEN" edc:nzwidth="32" edc:por="--------------------000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1058">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXEMPTYISE" edc:desc="Transmit Buffer Empty Interrupt Signal Enable bit" edc:mask="0x1" edc:name="TXEMPTYISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXFULLISE" edc:desc="Transmit Buffer Full Interrupt Signal Enable bit" edc:mask="0x1" edc:name="TXFULLISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXTHRISE" edc:desc="Transmit Buffer Threshold Interrupt Signal Enable bit" edc:mask="0x1" edc:name="TXTHRISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXEMPTYISE" edc:desc="Receive Buffer Empty Interrupt Signal Enable bit" edc:mask="0x1" edc:name="RXEMPTYISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXFULLISE" edc:desc="Receive Buffer Full Interrupt Signal Enable bit" edc:mask="0x1" edc:name="RXFULLISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXTHRISE" edc:desc="Receive Buffer Threshold Interrupt Signal Enable bit" edc:mask="0x1" edc:name="RXTHRISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONFULLISE" edc:desc="Control Buffer Full Interrupt Signal Enable bit" edc:mask="0x1" edc:name="CONFULLISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONEMPTYISE" edc:desc="Control Buffer Empty Interrupt Signal Enable bit" edc:mask="0x1" edc:name="CONEMPTYISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONTHRISE" edc:desc="Control Buffer Threshold Interrupt Signal Enable bit" edc:mask="0x1" edc:name="CONTHRISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BDDONEISE" edc:desc="DMA Buffer Descriptor Done Interrupt Signal Enable bit" edc:mask="0x1" edc:name="BDDONEISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PKTCOMPISE" edc:desc="DMA Buffer Descriptor Packet Complete Interrupt Signal Enable bit" edc:mask="0x1" edc:name="PKTCOMPISE" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Interrupt is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMAEISE" edc:desc="DMA Bus Error Interrupt Signal Enable bit" edc:mask="0x1" edc:name="DMAEISE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Interrupt signal is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Interrupt signal is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnnnnnnnnnn--nnnnnnnnnnnnnn" edc:cname="SQI1TAPCON" edc:desc="SQI Tap Control Register" edc:impl="0x3fff3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuuuuuuuuuu--00000000000000" edc:name="SQI1TAPCON" edc:nzwidth="32" edc:por="--xxxxxxxxxxxxxx--00000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E105C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKOUTDLY" edc:desc="SQI Clock Output Delay bits" edc:mask="0xf" edc:name="CLKOUTDLY" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:desc="16 taps added on clock output" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:SFRFieldSemantic edc:desc="15 taps added on clock output" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:SFRFieldSemantic edc:desc="2 taps added on clock output" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="1 tap added on clock output" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATAOUTDLY" edc:desc="SQI Data Output Delay bits" edc:mask="0xf" edc:name="DATAOUTDLY" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:desc="16 taps added on clock output" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:SFRFieldSemantic edc:desc="15 taps added on clock output" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:SFRFieldSemantic edc:desc="2 taps added on clock output" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="1 tap added on clock output" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDRCLKINDLY" edc:desc="SQI Clock Input Delay bits" edc:mask="0x3f" edc:name="SDRCLKINDLY" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:desc="64 taps added on clock input" edc:when="(field &amp; 0x3f) == 0x3f"/>
              <edc:SFRFieldSemantic edc:desc="63 taps added on clock input" edc:when="(field &amp; 0x3f) == 0x3e"/>
              <edc:SFRFieldSemantic edc:desc="2 taps added on clock input" edc:when="(field &amp; 0x3f) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="1 tap added on clock input" edc:when="(field &amp; 0x3f) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DDRDATINDLY" edc:mask="0xf" edc:name="DDRDATINDLY" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SDRDATINDLY" edc:mask="0xf" edc:name="SDRDATINDLY" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DDRCLKINDLY" edc:mask="0x3f" edc:name="DDRCLKINDLY" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------nnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1MEMSTAT" edc:desc="SQI Memory Status Register" edc:impl="0x1fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------000000000000000000000" edc:name="SQI1MEMSTAT" edc:nzwidth="32" edc:por="-----------000000000000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STATCMD" edc:desc="Status Command bits. The status check command is written into these bits." edc:mask="0xffff" edc:name="STATCMD" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="STATBYTES" edc:desc="Number of Status Bytes bits" edc:mask="0x3" edc:name="STATBYTES" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Status command/read is 2 bytes long" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Status command/read is 1 byte long" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATTYPE" edc:desc="Status Command/Read Lane Mode bits" edc:mask="0x3" edc:name="STATTYPE" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Status command and read are executed in Quad Lane mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Status command and read are executed in Dual Lane mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Status command and read are executed in Single Lane mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATPOS" edc:desc="Statis Bit Position in Flash bit" edc:mask="0x1" edc:name="STATPOS" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="BUSY bit position is bit 7 in status register" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="BUSY bit position is bit 0 in status register" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
