Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1XCON3" edc:desc="SQI XIP Control Register 3" edc:impl="0x1fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000000000000000000000000000" edc:name="SQI1XCON3" edc:nzwidth="32" edc:por="---00000000000000000000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INIT1CMD1" edc:desc="Flash Initialization Command 1 bits. First command of the Flash initialization." edc:mask="0xff" edc:name="INIT1CMD1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT1CMD2" edc:desc="Flash Initialization Command 2 bits. Second command of the Flash initialization." edc:mask="0xff" edc:name="INIT1CMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT1CMD3" edc:desc="Flash Initialization Command 3 bits. Third command of the Flash initialization." edc:mask="0xff" edc:name="INIT1CMD3" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT1TYPE" edc:desc="Flash Initialization 1 Command Type bits" edc:mask="0x3" edc:name="INIT1TYPE" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="INIT1 commands are sent in Quad Lane mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="INIT1 commands are sent in Dual Lane mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="INIT1 commadns are sent in Single Lane mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INIT1COUNT" edc:desc="Flash Initialization 1 Command Count bits" edc:mask="0x3" edc:name="INIT1COUNT" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="INIT1CMD3, INIT1CMD2, and INIT1CMD3 are sent." edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="INIT1CMD1 and INIT1CMD2 are sent, but INIT1CMD3 is still pending." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="INIT1CMD1 is sent, but INIT1CMD2 and INIT1CMD3 are still pending." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="No commands are sent" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INIT1SCHECK" edc:desc="Flash Initialization 1 Command Status Check bit" edc:mask="0x1" edc:name="INIT1SCHECK" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Check the status after executing the INIT1 command" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Do not check the status" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1XCON4" edc:desc="SQI XIP Control Register 4" edc:impl="0x1fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000000000000000000000000000" edc:name="SQI1XCON4" edc:nzwidth="32" edc:por="---00000000000000000000000000000" ltx:memberofperipheral="SQI1" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6c" edc:_addr="0x1F8E1068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INIT2CMD1" edc:desc="Flash Initialization Command 1 bits. First command of the Flash initialization." edc:mask="0xff" edc:name="INIT2CMD1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT2CMD2" edc:desc="Flash Initialization Command 2 bits. Second command of the Flash initialization." edc:mask="0xff" edc:name="INIT2CMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT2CMD3" edc:desc="Flash Initialization Command 3 bits. Third command of the Flash initialization." edc:mask="0xff" edc:name="INIT2CMD3" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT2TYPE" edc:desc="Flash Initialization 2 Command Type bits" edc:mask="0x3" edc:name="INIT2TYPE" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="INIT2 commands are sent in Quad Lane mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="INIT2 commands are sent in Dual Lane mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="INIT2 commands are sent in Single Lane mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INIT2COUNT" edc:desc="Flash Initialization 2 Command Count bits" edc:mask="0x3" edc:name="INIT2COUNT" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="INIT2CMD1, INIT2CMD2, and INIT2CMD3 are sent" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="INIT2CMD1 and INIT2CMD2 are sent, but INIT2CMD3 is still pending" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="INIT2CMD1 is sent, but INIT2CMD2 and INIT2CMD3 are still pending" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="No commands are sent" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INIT2SCHECK" edc:desc="Flash Initialization 2 Command Status Check bit" edc:mask="0x1" edc:name="INIT2SCHECK" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Check the status after executing the INIT2 command" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Do not check the status" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2f94" edc:_addr="0x1F8E106C"/>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEVER" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="CEVER" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:baseofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ID" edc:desc="" edc:mask="0xffff" edc:name="ID" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="" edc:mask="0xff" edc:name="VERSION" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="" edc:mask="0xff" edc:name="REVISION" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------nnn--nnn" edc:cname="CECON" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------000--000" edc:name="CECON" edc:nzwidth="32" edc:por="------------------------000--000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4004">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BDPPLEN" edc:desc="" edc:mask="0x1" edc:name="BDPPLEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BDPCHST" edc:desc="" edc:mask="0x1" edc:name="BDPCHST" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SWAPEN" edc:desc="" edc:mask="0x1" edc:name="SWAPEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="" edc:mask="0x1" edc:name="SWRST" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWAPOEN" edc:mask="0x1" edc:name="SWAPOEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEBDADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEBDADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4008">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDPADDR" edc:desc="" edc:mask="0xffffffff" edc:name="BDPADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEBDPADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEBDPADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E400C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BASEADDR" edc:desc="" edc:mask="0xffffffff" edc:name="BASEADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
