Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="rrrrrrrr--rrrrrrrrrrrrrrrrrrrrrr" edc:cname="CESTAT" edc:desc="" edc:impl="0xff3fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000--0000000000000000000000" edc:name="CESTAT" edc:nzwidth="32" edc:por="00000000--0000000000000000000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4010">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDCTRL" edc:desc="" edc:mask="0xffff" edc:name="BDCTRL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="START" edc:desc="" edc:mask="0x1" edc:name="START" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BDSTATE" edc:desc="" edc:mask="0xf" edc:name="BDSTATE" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ERRPHASE" edc:desc="" edc:mask="0x3" edc:name="ERRPHASE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ERROP" edc:desc="" edc:mask="0x7" edc:name="ERROP" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="ERRMODE" edc:desc="" edc:mask="0x7" edc:name="ERRMODE" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------rrrr" edc:cname="CEINTSRC" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEINTSRC" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4014">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PENDIF" edc:desc="" edc:mask="0x1" edc:name="PENDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CBDIF" edc:desc="" edc:mask="0x1" edc:name="CBDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PKTIF" edc:desc="" edc:mask="0x1" edc:name="PKTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AREIF" edc:desc="" edc:mask="0x1" edc:name="AREIF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="CEINTEN" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEINTEN" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4018">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PENDIE" edc:desc="" edc:mask="0x1" edc:name="PENDIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CBDIE" edc:desc="" edc:mask="0x1" edc:name="CBDIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PKTIE" edc:desc="" edc:mask="0x1" edc:name="PKTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AREIE" edc:desc="" edc:mask="0x1" edc:name="AREIE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CEPOLLCON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CEPOLLCON" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E401C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDPPLCON" edc:desc="" edc:mask="0xffff" edc:name="BDPPLCON" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------nnnnnnnn" edc:cname="CEHDLEN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CEHDLEN" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4020">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HDRLEN" edc:desc="" edc:mask="0xff" edc:name="HDRLEN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------nnnnnnnn" edc:cname="CETRLLEN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CETRLLEN" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4024">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRLRLEN" edc:desc="" edc:mask="0xff" edc:name="TRLRLEN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="CEDTXSTAT" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="CEDTXSTAT" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4028">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DTXSTATE" edc:desc="" edc:mask="0xf" edc:name="DTXSTATE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DTXBLEN" edc:desc="" edc:mask="0xffff" edc:name="DTXBLEN" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="CEDRXSTAT" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="CEDRXSTAT" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E402C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DRXSTATE" edc:desc="" edc:mask="0xf" edc:name="DRXSTATE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DRXBLEN" edc:desc="" edc:mask="0xffff" edc:name="DRXBLEN" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------rrrr" edc:cname="CEDCRYPTOADDR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEDCRYPTOADDR" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4030">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CRYPTOADDR" edc:desc="" edc:mask="0xf" edc:name="CRYPTOADDR" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
