Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="----------------------------rrrr" edc:cname="CEDHASHADDR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEDHASHADDR" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4034">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HASHADDR" edc:desc="" edc:mask="0xf" edc:name="HASHADDR" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------------rr" edc:cname="CEDTXADDR" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="CEDTXADDR" edc:nzwidth="32" edc:por="------------------------------00" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4038">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXDADDR" edc:desc="" edc:mask="0x3" edc:name="TXDADDR" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEDML0ADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEDML0ADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E403C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ML0ADDR" edc:desc="" edc:mask="0xffffffff" edc:name="ML0ADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEDML1ADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEDML1ADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4040">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ML1ADDR" edc:desc="" edc:mask="0xffffffff" edc:name="ML1ADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEDOL0ADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEDOL0ADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4044">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OL0ADDR" edc:desc="" edc:mask="0xffffffff" edc:name="OL0ADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------rrrr" edc:cname="CEDCSTADDDR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEDCSTADDDR" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4048">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSTATEADDR" edc:desc="" edc:mask="0xf" edc:name="CSTATEADDR" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------------rr" edc:cname="CEDMTSKADDR" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------xx" edc:name="CEDMTSKADDR" edc:nzwidth="32" edc:por="------------------------------xx" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E404C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MTASKADDR" edc:desc="" edc:mask="0x3" edc:name="MTASKADDR" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEDSACON" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEDSACON" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4050">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SACON" edc:desc="" edc:mask="0xffffffff" edc:name="SACON" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------rrrr" edc:cname="CEDCSTATE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEDCSTATE" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4054">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSTATE" edc:desc="" edc:mask="0xf" edc:name="CSTATE" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
