Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="---------------------------rrrrr" edc:cname="CEDTXBCNT" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="CEDTXBCNT" edc:nzwidth="32" edc:por="---------------------------00000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E4058">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTXBCNT" edc:desc="" edc:mask="0x1f" edc:name="CTXBCNT" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------------rrrrrrr" edc:cname="CEDRXBCNT" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------0000000" edc:name="CEDRXBCNT" edc:nzwidth="32" edc:por="-------------------------0000000" ltx:memberofperipheral="CRYPTO" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x60" edc:_addr="0x1F8E405C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DRXBCNT" edc:desc="" edc:mask="0x7f" edc:name="DRXBCNT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CEREV" edc:desc="" edc:impl="0xffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------uuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CEREV" edc:nzwidth="32" edc:por="--------xxxxxxxxxxxxxxxxxxxxxxxx" edc:_addr="0x1F8E4060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MAJOR" edc:mask="0xff" edc:name="MAJOR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="MINOR" edc:mask="0xff" edc:name="MINOR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="MAINTENANCE" edc:mask="0xff" edc:name="MAINTENANCE" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xF9C" edc:_addr="0x1F8E4064"/>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGVER" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGVER" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:baseofperipheral="RNG" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x24" edc:_addr="0x1F8E5000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="" edc:mask="0x7f" edc:name="REVISION" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="" edc:mask="0x1ff" edc:name="VERSION" edc:nzwidth="9"/>
            <edc:SFRFieldDef edc:cname="ID" edc:desc="" edc:mask="0xffff" edc:name="ID" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------n-nnnnnnnnnnn" edc:cname="RNGCON" edc:desc="" edc:impl="0x17ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0-00001000000" edc:name="RNGCON" edc:nzwidth="32" edc:por="-------------------0-00001000000" ltx:memberofperipheral="RNG" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x24" edc:_addr="0x1F8E5004">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0xff" edc:name="PLEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="TRNGEN" edc:desc="" edc:mask="0x1" edc:name="TRNGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PRNGEN" edc:desc="" edc:mask="0x1" edc:name="PRNGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CONT" edc:desc="" edc:mask="0x1" edc:name="CONT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRNGMODE" edc:desc="" edc:mask="0x1" edc:name="TRNGMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:desc="" edc:mask="0x1" edc:name="LOAD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGPOLY1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111110000000000000000" edc:name="RNGPOLY1" edc:nzwidth="32" edc:por="11111111111111110000000000000000" ltx:memberofperipheral="RNG" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x24" edc:_addr="0x1F8E5008">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POLY" edc:desc="" edc:mask="0xffffffff" edc:name="POLY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGPOLY2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111110000000000000000" edc:name="RNGPOLY2" edc:nzwidth="32" edc:por="11111111111111110000000000000000" ltx:memberofperipheral="RNG" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x24" edc:_addr="0x1F8E500C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POLY" edc:desc="" edc:mask="0xffffffff" edc:name="POLY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGNUMGEN1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111111111111111111111" edc:name="RNGNUMGEN1" edc:nzwidth="32" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="RNG" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x24" edc:_addr="0x1F8E5010">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RNG" edc:desc="" edc:mask="0xffffffff" edc:name="RNG" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGNUMGEN2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111111111111111111111" edc:name="RNGNUMGEN2" edc:nzwidth="32" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="RNG" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x24" edc:_addr="0x1F8E5014">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RNG" edc:desc="" edc:mask="0xffffffff" edc:name="RNG" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
