Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGSEED1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGSEED1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RNG" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x24" edc:_addr="0x1F8E5018">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEED" edc:desc="" edc:mask="0xffffffff" edc:name="SEED" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGSEED2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGSEED2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RNG" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x24" edc:_addr="0x1F8E501C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEED" edc:desc="" edc:mask="0xffffffff" edc:name="SEED" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------------nnnnnnn" edc:cname="RNGCNT" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------0000000" edc:name="RNGCNT" edc:nzwidth="32" edc:por="-------------------------0000000" ltx:memberofperipheral="RNG" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x24" edc:_addr="0x1F8E5020">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RCNT" edc:desc="" edc:mask="0x7f" edc:name="RCNT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:GPRDataSector edc:beginaddr="0x1F900000" edc:endaddr="0x1F902000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:regionid="crypto1SCM"/>
    <edc:GPRDataSector edc:beginaddr="0x1F902000" edc:endaddr="0x1F904000" edc:kseg0="0x80000000" edc:kseg1="0x80000000" edc:ksegdef="1" edc:regionid="crypto1UCM"/>
    <edc:SFRDataSector edc:beginaddr="0x1F920000" edc:endaddr="0x1F940000" edc:kseg0="0x80000000" edc:kseg1="0x80000000" edc:ksegdef="2" edc:regionid="periph_indep_b">
      <edc:SFRDef edc:access="-----------nnnnn---nnnnn---nnnnn" edc:cname="PKCONFIG" edc:desc="" edc:impl="0x1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------uuuuu---uuuuu---uuuuu" edc:name="PKCONFIG" edc:nzwidth="32" edc:por="-----------xxxxx---xxxxx---xxxxx" edc:_addr="0x1F920000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OPPTRA" edc:mask="0x1f" edc:name="OPPTRA" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OPPTRB" edc:mask="0x1f" edc:name="OPPTRB" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OPPTRC" edc:mask="0x1f" edc:name="OPPTRC" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnn-------------nnnnnnnnnnnnnnnn" edc:cname="PKCOMMAND" edc:desc="" edc:impl="0xe000ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-------------uuuuuuuuuuuuuuuu" edc:name="PKCOMMAND" edc:nzwidth="32" edc:por="xxx-------------xxxxxxxxxxxxxxxx" edc:_addr="0x1F920004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OPERATION" edc:mask="0x7f" edc:name="OPERATION" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="FIELD" edc:mask="0x1" edc:name="FIELD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPSIZE" edc:mask="0xff" edc:name="OPSIZE" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="SIGNA" edc:mask="0x1" edc:name="SIGNA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGNB" edc:mask="0x1" edc:name="SIGNB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CALCR2" edc:mask="0x1" edc:name="CALCR2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="PKCONTROL" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------u" edc:name="PKCONTROL" edc:nzwidth="32" edc:por="-------------------------------x" edc:_addr="0x1F920008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="START" edc:mask="0x1" edc:name="START" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------n---rrrr-rrrrrrrr" edc:cname="PKSTATUS" edc:desc="" edc:impl="0x11eff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------u---uuuu-uuuuuuuu" edc:name="PKSTATUS" edc:nzwidth="32" edc:por="---------------x---xxxx-xxxxxxxx" edc:_addr="0x1F92000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EADDR" edc:mask="0xf" edc:name="EADDR" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PXNOC" edc:mask="0x1" edc:name="PXNOC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PXINF" edc:mask="0x1" edc:name="PXINF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPLINVAL" edc:mask="0x1" edc:name="CPLINVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PNINVAL" edc:mask="0x1" edc:name="PNINVAL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGINVAL" edc:mask="0x1" edc:name="SIGINVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PABINVAL" edc:mask="0x1" edc:name="PABINVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NONINV" edc:mask="0x1" edc:name="NONINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRIME" edc:mask="0x1" edc:name="PRIME" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PKVERSION" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------uuuuuuuuuuuuuuuu" edc:name="PKVERSION" edc:nzwidth="32" edc:por="----------------xxxxxxxxxxxxxxxx" edc:_addr="0x1F920010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SWVER" edc:mask="0xff" edc:name="SWVER" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="HWVER" edc:mask="0xff" edc:name="HWVER" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xFFEC" edc:_addr="0x1F920014"/>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x1F930000"/>
    </edc:SFRDataSector>
  </edc:PhysicalSpace>
  <edc:PinList edc:desc="PIC32MZ1025W104132 (132-pin MODULE)&#10;#BGA_TRANSLATION:132_DQFN# #NO_PAD_ORDER_CHECK#" edc:ppsflavor="simple">
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDDB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="pmu_vsense"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="vpmu_vddc"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD33"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVDT12"/>
      <edc:VirtualPin edc:name="ETXD1"/>
      <edc:VirtualPin edc:name="RPC14"/>
      <edc:VirtualPin edc:name="IOCC14"/>
      <edc:VirtualPin edc:name="RC14"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVDT13"/>
      <edc:VirtualPin edc:name="ETXD0"/>
      <edc:VirtualPin edc:name="RPC15"/>
      <edc:VirtualPin edc:name="IOCC15"/>
      <edc:VirtualPin edc:name="RC15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD33"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVDT15"/>
      <edc:VirtualPin edc:name="EMDIO"/>
      <edc:VirtualPin edc:name="RPK13"/>
      <edc:VirtualPin edc:name="IOCK13"/>
      <edc:VirtualPin edc:name="RK13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVDT16"/>
      <edc:VirtualPin edc:name="EMDC"/>
      <edc:VirtualPin edc:name="RPK14"/>
      <edc:VirtualPin edc:name="IOCK14"/>
      <edc:VirtualPin edc:name="RK14"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVDT14"/>
      <edc:VirtualPin edc:name="ERXDV"/>
      <edc:VirtualPin edc:name="RPK12"/>
      <edc:VirtualPin edc:name="IOCK12"/>
      <edc:VirtualPin edc:name="RK12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVDT7"/>
      <edc:VirtualPin edc:name="ERXERR"/>
      <edc:VirtualPin edc:name="RPC9"/>
      <edc:VirtualPin edc:name="IOCC9"/>
      <edc:VirtualPin edc:name="RC9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREGCAP2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TSTSIBVISI0"/>
      <edc:VirtualPin edc:name="SQICS0"/>
      <edc:VirtualPin edc:name="CVDT17"/>
      <edc:VirtualPin edc:name="RPA0"/>
      <edc:VirtualPin edc:name="IOCA0"/>
      <edc:VirtualPin edc:name="RA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREGCAP0"/>
      <edc:VirtualPin edc:name="VREGCAP1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TSTSIBVISI1"/>
      <edc:VirtualPin edc:name="SQICS1"/>
      <edc:VirtualPin edc:name="CVDT18"/>
      <edc:VirtualPin edc:name="RPC0"/>
      <edc:VirtualPin edc:name="IOCC0"/>
      <edc:VirtualPin edc:name="RC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TSTSIBVISI2"/>
      <edc:VirtualPin edc:name="SQID3"/>
      <edc:VirtualPin edc:name="CVDT19"/>
      <edc:VirtualPin edc:name="RPC1"/>
      <edc:VirtualPin edc:name="IOCC1"/>
      <edc:VirtualPin edc:name="RC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TSTSIBVISI3"/>
      <edc:VirtualPin edc:name="SQID2"/>
      <edc:VirtualPin edc:name="CVDT20"/>
      <edc:VirtualPin edc:name="RPC2"/>
      <edc:VirtualPin edc:name="IOCC2"/>
      <edc:VirtualPin edc:name="RC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SQID1"/>
      <edc:VirtualPin edc:name="CVDT21"/>
      <edc:VirtualPin edc:name="RPC3"/>
      <edc:VirtualPin edc:name="IOCC3"/>
      <edc:VirtualPin edc:name="RC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD33"/>
      <edc:VirtualPin edc:name="ENVREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SCLKI"/>
      <edc:VirtualPin edc:name="SQID0"/>
      <edc:VirtualPin edc:name="CVDT22"/>
      <edc:VirtualPin edc:name="RPC4"/>
      <edc:VirtualPin edc:name="IOCC4"/>
      <edc:VirtualPin edc:name="RC4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SQICLK"/>
      <edc:VirtualPin edc:name="CVDT23"/>
      <edc:VirtualPin edc:name="RPC5"/>
      <edc:VirtualPin edc:name="IOCC5"/>
      <edc:VirtualPin edc:name="RC5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPC6"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="IOCC6"/>
      <edc:VirtualPin edc:name="RC6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPC7"/>
      <edc:VirtualPin edc:name="SDI1"/>
      <edc:VirtualPin edc:name="IOCC7"/>
      <edc:VirtualPin edc:name="RC7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPC8"/>
      <edc:VirtualPin edc:name="SDO1"/>
      <edc:VirtualPin edc:name="IOCC8"/>
      <edc:VirtualPin edc:name="RC8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPA1"/>
      <edc:VirtualPin edc:name="SS1"/>
      <edc:VirtualPin edc:name="CS1"/>
      <edc:VirtualPin edc:name="FSYNC1"/>
      <edc:VirtualPin edc:name="IOCA1"/>
      <edc:VirtualPin edc:name="RA1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD33"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPA2"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="IOCA2"/>
      <edc:VirtualPin edc:name="RA2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPA3"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="IOCA3"/>
      <edc:VirtualPin edc:name="RA3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPA4"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="IOCA4"/>
      <edc:VirtualPin edc:name="RA4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPA5"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="IOCA5"/>
      <edc:VirtualPin edc:name="RA5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="U1CTSn"/>
      <edc:VirtualPin edc:name="IOCA6"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="U1RTSn"/>
      <edc:VirtualPin edc:name="U1BCLK"/>
      <edc:VirtualPin edc:name="IOCA7"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="U1RX"/>
      <edc:VirtualPin edc:name="IOCA8"/>
      <edc:VirtualPin edc:name="RA8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="U1TX"/>
      <edc:VirtualPin edc:name="IOCA9"/>
      <edc:VirtualPin edc:name="RA9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREGCTRL0"/>
      <edc:VirtualPin edc:name="BT_CLK_OUT"/>
      <edc:VirtualPin edc:name="RPK4"/>
      <edc:VirtualPin edc:name="IOCK4"/>
      <edc:VirtualPin edc:name="RK4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREGCTRL1"/>
      <edc:VirtualPin edc:name="PTA_WLAN_ACTIVE"/>
      <edc:VirtualPin edc:name="RPK5"/>
      <edc:VirtualPin edc:name="IOCK5"/>
      <edc:VirtualPin edc:name="RK5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PTA_BT_PRIO"/>
      <edc:VirtualPin edc:name="RPK6"/>
      <edc:VirtualPin edc:name="IOCK6"/>
      <edc:VirtualPin edc:name="RK6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PTA_BT_ACTIVE"/>
      <edc:VirtualPin edc:name="RPK7"/>
      <edc:VirtualPin edc:name="IOCK7"/>
      <edc:VirtualPin edc:name="RK7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD33"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF_FE_7"/>
      <edc:VirtualPin edc:name="RPK8"/>
      <edc:VirtualPin edc:name="IOCK8"/>
      <edc:VirtualPin edc:name="RK8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF_FE_8"/>
      <edc:VirtualPin edc:name="RPK9"/>
      <edc:VirtualPin edc:name="IOCK9"/>
      <edc:VirtualPin edc:name="RK9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF_FE_6"/>
      <edc:VirtualPin edc:name="RPK10"/>
      <edc:VirtualPin edc:name="IOCK10"/>
      <edc:VirtualPin edc:name="RK10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF_FE_5"/>
      <edc:VirtualPin edc:name="RPK11"/>
      <edc:VirtualPin edc:name="IOCK11"/>
      <edc:VirtualPin edc:name="RK11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="spi_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="afe_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="xtal_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Xtal_in"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Xtal_out"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="iovdd_rf"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="analog_test"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="in_tssi"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="syn_sd_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="syn_pll_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="syn_vco_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="iovdd_rf"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="mbs_extra_48k"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="rxr_in2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="rxr_fe2_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="rxr_riq_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="rxr_fe1_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="rxr_in1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="bb_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="txr_umx_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="txr_lpa_vout"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="txr_lpa_vdd15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF_FE_3"/>
      <edc:VirtualPin edc:name="RPK0"/>
      <edc:VirtualPin edc:name="IOCK0"/>
      <edc:VirtualPin edc:name="RK0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF_FE_4"/>
      <edc:VirtualPin edc:name="RPK1"/>
      <edc:VirtualPin edc:name="IOCK1"/>
      <edc:VirtualPin edc:name="RK1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF_FE_1"/>
      <edc:VirtualPin edc:name="AN19"/>
      <edc:VirtualPin edc:name="CVD19"/>
      <edc:VirtualPin edc:name="CVDR19"/>
      <edc:VirtualPin edc:name="RPK2"/>
      <edc:VirtualPin edc:name="IOCK2"/>
      <edc:VirtualPin edc:name="RK2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF_FE_2"/>
      <edc:VirtualPin edc:name="AN18"/>
      <edc:VirtualPin edc:name="CVD18"/>
      <edc:VirtualPin edc:name="CVDR18"/>
      <edc:VirtualPin edc:name="RPK3"/>
      <edc:VirtualPin edc:name="IOCK3"/>
      <edc:VirtualPin edc:name="RK3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD33"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN17"/>
      <edc:VirtualPin edc:name="CVD17"/>
      <edc:VirtualPin edc:name="CVDR17"/>
      <edc:VirtualPin edc:name="RPA10"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="IOCA10"/>
      <edc:VirtualPin edc:name="RA10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPA11"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="IOCA11"/>
      <edc:VirtualPin edc:name="RA11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN16"/>
      <edc:VirtualPin edc:name="CVD16"/>
      <edc:VirtualPin edc:name="CVDR16"/>
      <edc:VirtualPin edc:name="RPA12"/>
      <edc:VirtualPin edc:name="IOCA12"/>
      <edc:VirtualPin edc:name="RA12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN15"/>
      <edc:VirtualPin edc:name="ANN1"/>
      <edc:VirtualPin edc:name="CVD15"/>
      <edc:VirtualPin edc:name="CVDR15"/>
      <edc:VirtualPin edc:name="RPA13"/>
      <edc:VirtualPin edc:name="IOCA13"/>
      <edc:VirtualPin edc:name="RA13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN14"/>
      <edc:VirtualPin edc:name="ANN0"/>
      <edc:VirtualPin edc:name="CVD14"/>
      <edc:VirtualPin edc:name="CVDR14"/>
      <edc:VirtualPin edc:name="RPA14"/>
      <edc:VirtualPin edc:name="IOCA14"/>
      <edc:VirtualPin edc:name="RA14"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="CVD13"/>
      <edc:VirtualPin edc:name="CVDR13"/>
      <edc:VirtualPin edc:name="RPA15"/>
      <edc:VirtualPin edc:name="IOCA15"/>
      <edc:VirtualPin edc:name="RA15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="CVD12"/>
      <edc:VirtualPin edc:name="CVDR12"/>
      <edc:VirtualPin edc:name="RPB14"/>
      <edc:VirtualPin edc:name="IOCB14"/>
      <edc:VirtualPin edc:name="RB14"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="CVD11"/>
      <edc:VirtualPin edc:name="CVDR11"/>
      <edc:VirtualPin edc:name="RPB13"/>
      <edc:VirtualPin edc:name="IOCB13"/>
      <edc:VirtualPin edc:name="RB13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANA0"/>
      <edc:VirtualPin edc:name="RPB12"/>
      <edc:VirtualPin edc:name="IOCB12"/>
      <edc:VirtualPin edc:name="RB12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANB0"/>
      <edc:VirtualPin edc:name="RPB11"/>
      <edc:VirtualPin edc:name="IOCB11"/>
      <edc:VirtualPin edc:name="RB11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVD10"/>
      <edc:VirtualPin edc:name="CVDR10"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="RPB10"/>
      <edc:VirtualPin edc:name="IOCB10"/>
      <edc:VirtualPin edc:name="RB10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Avss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGD4ENTRY"/>
      <edc:VirtualPin edc:name="PGD4"/>
      <edc:VirtualPin edc:name="EMUD4"/>
      <edc:VirtualPin edc:name="TDI"/>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="CVD9"/>
      <edc:VirtualPin edc:name="CVDR9"/>
      <edc:VirtualPin edc:name="RPB9"/>
      <edc:VirtualPin edc:name="IOCB9"/>
      <edc:VirtualPin edc:name="RB9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGC4ENTRY"/>
      <edc:VirtualPin edc:name="PGC4"/>
      <edc:VirtualPin edc:name="EMUC4"/>
      <edc:VirtualPin edc:name="TCK"/>
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="CVD8"/>
      <edc:VirtualPin edc:name="CVDR8"/>
      <edc:VirtualPin edc:name="RPB8"/>
      <edc:VirtualPin edc:name="IOCB8"/>
      <edc:VirtualPin edc:name="RB8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TDO"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="CVD7"/>
      <edc:VirtualPin edc:name="CVDR7"/>
      <edc:VirtualPin edc:name="CVDT0"/>
      <edc:VirtualPin edc:name="RPB7"/>
      <edc:VirtualPin edc:name="IOCB7"/>
      <edc:VirtualPin edc:name="RB7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TMS"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="CVD6"/>
      <edc:VirtualPin edc:name="CVDR6"/>
      <edc:VirtualPin edc:name="CVDT1"/>
      <edc:VirtualPin edc:name="RPB6"/>
      <edc:VirtualPin edc:name="IOCB6"/>
      <edc:VirtualPin edc:name="RB6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD33"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGD2ENTRY"/>
      <edc:VirtualPin edc:name="PGD2"/>
      <edc:VirtualPin edc:name="EMUD2"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="CVD5"/>
      <edc:VirtualPin edc:name="CVDR5"/>
      <edc:VirtualPin edc:name="CVDT2"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="RPB5"/>
      <edc:VirtualPin edc:name="IOCB5"/>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vbat"/>
    </edc:Pin>
