Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/edc/PIC32MZ2051W104132.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PGC2ENTRY"/>
      <edc:VirtualPin edc:name="PGC2"/>
      <edc:VirtualPin edc:name="EMUC2"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="CVD4"/>
      <edc:VirtualPin edc:name="CVDR4"/>
      <edc:VirtualPin edc:name="CVDT3"/>
      <edc:VirtualPin edc:name="RPB4"/>
      <edc:VirtualPin edc:name="IOCB4"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGC1ENTRY"/>
      <edc:VirtualPin edc:name="PGC1"/>
      <edc:VirtualPin edc:name="EMUC1"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="CVD3"/>
      <edc:VirtualPin edc:name="CVDR3"/>
      <edc:VirtualPin edc:name="CVDT4"/>
      <edc:VirtualPin edc:name="RPB3"/>
      <edc:VirtualPin edc:name="USBOEN"/>
      <edc:VirtualPin edc:name="IOCB3"/>
      <edc:VirtualPin edc:name="RB3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGD1ENTRY"/>
      <edc:VirtualPin edc:name="PGD1"/>
      <edc:VirtualPin edc:name="EMUD1"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="CVD2"/>
      <edc:VirtualPin edc:name="CVDR2"/>
      <edc:VirtualPin edc:name="CVDT5"/>
      <edc:VirtualPin edc:name="RPB2"/>
      <edc:VirtualPin edc:name="USBID"/>
      <edc:VirtualPin edc:name="IOCB2"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TA4A"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="CVD1"/>
      <edc:VirtualPin edc:name="CVDR1"/>
      <edc:VirtualPin edc:name="CVDT6"/>
      <edc:VirtualPin edc:name="ETH_EXCLK_OUT"/>
      <edc:VirtualPin edc:name="RPB1"/>
      <edc:VirtualPin edc:name="VBUSON"/>
      <edc:VirtualPin edc:name="IOCB1"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="RPB0"/>
      <edc:VirtualPin edc:name="IOCB0"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="D-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="D+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VUSB3V3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBUS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREGCAP3"/>
      <edc:VirtualPin edc:name="VREGCAP5"/>
      <edc:VirtualPin edc:name="VREGCAP6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREGCAP4"/>
      <edc:VirtualPin edc:name="VREGCAP7"/>
      <edc:VirtualPin edc:name="VREGCAP8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD33"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVDT8"/>
      <edc:VirtualPin edc:name="ERXD1"/>
      <edc:VirtualPin edc:name="RPC10"/>
      <edc:VirtualPin edc:name="IOCC10"/>
      <edc:VirtualPin edc:name="RC10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVDT9"/>
      <edc:VirtualPin edc:name="ERXD0"/>
      <edc:VirtualPin edc:name="RPC11"/>
      <edc:VirtualPin edc:name="IOCC11"/>
      <edc:VirtualPin edc:name="RC11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVDT10"/>
      <edc:VirtualPin edc:name="ETH_CLK_OUT"/>
      <edc:VirtualPin edc:name="ERXCLK"/>
      <edc:VirtualPin edc:name="RPC12"/>
      <edc:VirtualPin edc:name="IOCC12"/>
      <edc:VirtualPin edc:name="RC12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVDT11"/>
      <edc:VirtualPin edc:name="ETXEN"/>
      <edc:VirtualPin edc:name="RPC13"/>
      <edc:VirtualPin edc:name="IOCC13"/>
      <edc:VirtualPin edc:name="RC13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="buk_mdlo_out"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="vpmu_vddp"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="vpmu_vddp"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="buk_bk_lx"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
